espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
/* ESP32-S2ULP ELF-32 support for BFD.
Copyright (c) 2016-2017 Espressif Systems (Shanghai) PTE LTD.

based on Copyright (C) 2005-2017 Free Software Foundation, Inc.

This file is part of BFD, the Binary File Descriptor library.

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software Foundation,
Inc., 51 Franklin Street - Fifth Floor, Boston, MA 02110-1301, USA.  */

#include "sysdep.h"
#include "bfd.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "elf/esp32s2ulp.h"
#include "dwarf2.h"
#include "hashtab.h"

static bfd_reloc_status_type esp32s2ulp_pltpc_reloc( 
	bfd *abfd ATTRIBUTE_UNUSED, arelent *reloc_entry ATTRIBUTE_UNUSED, asymbol *symbol ATTRIBUTE_UNUSED, 
	void * data ATTRIBUTE_UNUSED, asection *input_section ATTRIBUTE_UNUSED, bfd *output_bfd ATTRIBUTE_UNUSED, char **error_message ATTRIBUTE_UNUSED
	)
{
	bfd_reloc_status_type flag = bfd_reloc_ok;
	return flag;
}


static bfd_reloc_status_type esp32s2ulp_jumprelr_reloc(bfd *abfd, arelent *reloc_entry, asymbol *symbol, void * data, asection *input_section, bfd *output_bfd, char **error_message ATTRIBUTE_UNUSED)
{
	bfd_vma relocation;
	bfd_size_type addr = reloc_entry->address;
	bfd_vma output_base = 0;
	asection *output_section;
	bfd_boolean relocatable = (output_bfd != NULL);

	//DEBUG_TRACE("dya_pass esp32s2ulp_jumprelr_reloc: relocatable=%i\n", (int)relocatable);

	/* Is the address of the relocation really within the section?  */
	if (reloc_entry->address > bfd_get_section_limit(abfd, input_section))
		return bfd_reloc_outofrange;

	if (bfd_is_und_section(symbol->section)
		&& (symbol->flags & BSF_WEAK) == 0
		&& !relocatable)
		return bfd_reloc_undefined;

	output_section = symbol->section->output_section;
	relocation = symbol->value;
	/* Convert input-section-relative symbol value to absolute.  */
	if (relocatable)
		output_base = 0;
	else
		output_base = output_section->vma;

	if ((symbol->name
		&& symbol->section->name
		&& !strcmp(symbol->name, symbol->section->name))
		|| !relocatable)
	{
		relocation += output_base + symbol->section->output_offset;
	}

	relocation += reloc_entry->addend;

	if (relocatable)
	{
		/* This output will be relocatable ... like ld -r. */
		reloc_entry->address += input_section->output_offset;
		reloc_entry->addend += symbol->section->output_offset;
		//DEBUG_TRACE("dya_pass esp32s2ulp_jumprelr_reloc: address=%08x, addend=%08x, symbol->value=%08x\n", (int)reloc_entry->address, (int)reloc_entry->addend, (int)symbol->value);
	}
	else
	{
		reloc_entry->addend = 0;
	}

	/* Here the variable relocation holds the final address of the
	symbol we are relocating against, plus any addend.  */
	unsigned int ddd = 0;
	memcpy(&ddd, (unsigned char *)data + addr, 4);
	relocation -= reloc_entry->address;
	//DEBUG_TRACE("dya_pass esp32s2ulp_jumprelr_reloc: relocation=%08x, ddd=%08x\n", (unsigned int)relocation, ddd);
	ddd &= ~(0x000000ff < 18);
	int reloc = (int)relocation;
	reloc = reloc >> 2;
	//printf("relock=%i \n",reloc);
	if ((reloc > 0x7f) || (reloc < -0x7f))
	{
		return bfd_reloc_outofrange;
	}
	if (reloc >= 0)
	{
		ddd |= ((reloc & 0x7f) << 18);
	}
	else
	{
		reloc = -reloc;
		ddd |= ((reloc & 0x7f) << 18) | (0x01 << 25);
	}
	memcpy((unsigned char *)data + addr, &ddd, 4);
	//DEBUG_TRACE("dya_pass esp32s2ulp_jumprelr_reloc: final = reloc=%08x, ddd=%08x\n", (unsigned int)reloc, ddd);
	return bfd_reloc_ok;
}

static bfd_reloc_status_type esp32s2ulp_bfd_reloc(bfd *abfd, arelent *reloc_entry, asymbol *symbol, void * data, asection *input_section, bfd *output_bfd, char **error_message ATTRIBUTE_UNUSED)
{
	bfd_vma relocation;
	bfd_size_type addr = reloc_entry->address;
	bfd_vma output_base = 0;
	reloc_howto_type *howto = reloc_entry->howto;
	asection *output_section;
	bfd_boolean relocatable = (output_bfd != NULL);

	/* Is the address of the relocation really within the section?  */
	if (reloc_entry->address > bfd_get_section_limit(abfd, input_section))
		return bfd_reloc_outofrange;

	if (bfd_is_und_section(symbol->section)
		&& (symbol->flags & BSF_WEAK) == 0
		&& !relocatable)
		return bfd_reloc_undefined;

	/* Get symbol value.  (Common symbols are special.)  */
	if (bfd_is_com_section(symbol->section))
		relocation = 0;
	else
		relocation = symbol->value;

	output_section = symbol->section->output_section;

	/* Convert input-section-relative symbol value to absolute.  */
	if (relocatable)
		output_base = 0;
	else
		output_base = output_section->vma;

	if (!relocatable || !strcmp(symbol->name, symbol->section->name))
		relocation += output_base + symbol->section->output_offset;

	if (!relocatable && !strcmp(symbol->name, symbol->section->name))
	{
		/* Add in supplied addend.  */
		relocation += reloc_entry->addend;
	}

	/* Here the variable relocation holds the final address of the
	symbol we are relocating against, plus any addend.  */

	if (howto->pc_relative == TRUE)
	{
		relocation -= input_section->output_section->vma + input_section->output_offset;

		if (howto->pcrel_offset == TRUE)
			relocation -= reloc_entry->address;
	}

	if (relocatable)
	{
		reloc_entry->address += input_section->output_offset;
		reloc_entry->addend += symbol->section->output_offset;
	}

	if (howto->complain_on_overflow != complain_overflow_dont)
	{
		bfd_reloc_status_type status;

		status = bfd_check_overflow(howto->complain_on_overflow,
			howto->bitsize,
			howto->rightshift,
			bfd_arch_bits_per_address(abfd),
			relocation);
		if (status != bfd_reloc_ok)
			return status;
	}

	/* If rightshift is 1 and the number odd, return error.  */
	if (howto->rightshift && (relocation & 0x01))
	{
		_bfd_error_handler(_("relocation should be even number"));
		return bfd_reloc_overflow;
	}

	relocation >>= (bfd_vma)howto->rightshift;

	/* Shift everything up to where it's going to be used.  */

