espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	relocation <<= (bfd_vma)howto->bitpos;

#define DOIT(x)								\
  x = ( (x & ~howto->dst_mask) | (relocation & howto->dst_mask))

	/* handle 8 and 16 bit relocations here. */
	switch (howto->size)
	{
	case 0:
	{
		char x = bfd_get_8(abfd, (char *)data + addr);
		DOIT(x);
		bfd_put_8(abfd, x, (unsigned char *)data + addr);
	}
	break;

	case 1:
	{
		unsigned short x = bfd_get_16(abfd, (bfd_byte *)data + addr);
		DOIT(x);
		bfd_put_16(abfd, (bfd_vma)x, (unsigned char *)data + addr);
	}
	break;

	default:
		return bfd_reloc_other;
	}

	return bfd_reloc_ok;
}

/* HOWTO Table for esp ulp.
 */

#define ESP32S2ULP_RELOC_MIN 0
#define ESP32S2ULP_RELOC_MAX 0x21
#define ESP32S2ULP_GNUEXT_RELOC_MIN 0x40
#define ESP32S2ULP_GNUEXT_RELOC_MAX 0x43
#define ESP32S2ULP_ARELOC_MIN 0xE0
#define ESP32S2ULP_ARELOC_MAX 0xF3

static reloc_howto_type esp32s2ulp_howto_table[] =
{
	/* This reloc does nothing. .  */
	HOWTO(R_ESP32S2ULP_UNUSED0,					/* type.  */
	0,											/* rightshift.  */
	3,											/* size (0 = byte, 1 = short, 2 = long).  */
	0,											/* bitsize.  */
	FALSE,										/* pc_relative.  */
	0,											/* bitpos.  */
	complain_overflow_dont,						/* complain_on_overflow.  */
	bfd_elf_generic_reloc,						/* special_function.  */
	"R_ESP32S2ULP_UNUSED0",						/* name.  */
	FALSE,										/* partial_inplace.  */
	0,											/* src_mask.  */
	0,											/* dst_mask.  */
	FALSE),										/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_RIMM16,		/* type.  */
	0,								/* rightshift.  */
	2,								/* size (0 = byte, 1 = short, 2 = long).  */
	11,								/* bitsize.  */
	FALSE,							/* pc_relative.  */
	2,								/* bitpos.  */
	complain_overflow_unsigned,		/* complain_on_overflow.  */
	NULL,			/* special_function.  */
	"R_ESP32S2ULP_RIMM16",			/* name.  */
	FALSE,							/* partial_inplace.  */
	0x00001FFC,						/* src_mask.  */ // dya-pass - 0
	0x00001FFC,						/* dst_mask.  */
	FALSE),							/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_JUMPR,			/* type.  */
	0,								/* rightshift.  */
	2,								/* size (0 = byte, 1 = short, 2 = long).  */
	8,								/* bitsize.  */
	TRUE,							/* pc_relative.  */
	18,								/* bitpos.  */
	complain_overflow_signed,		/* complain_on_overflow.  */
	esp32s2ulp_jumprelr_reloc,		/* special_function.  */
	"R_ESP32S2ULP_JUMPR",				/* name.  */
	FALSE,							/* partial_inplace.  */
	(0xff << 18),					/* src_mask.  */
	(0xff << 18),					/* dst_mask.  */
	TRUE),							/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_LOAD16,		/* type.  */
	0,								/* rightshift.  */
	2,								/* size (0 = byte, 1 = short, 2 = long).  */
	11,								/* bitsize.  */
	FALSE,							/* pc_relative.  */
	2,								/* bitpos.  */
	complain_overflow_unsigned,		/* complain_on_overflow.  */
	NULL,			/* special_function.  */
	"R_ESP32S2ULP_LOAD16",			/* name.  */
	FALSE,							/* partial_inplace.  */
	0x00001FFC,						/* src_mask.  */ // dya-pass - 0
	0x00001FFC,						/* dst_mask.  */
	FALSE),							/* pcrel_offset.  */
	
	HOWTO(R_ESP32S2ULP_WR_MEM,		/* type.  */
	0,			                    /* rightshift.  */
	2,			                    /* size (0 = byte, 1 = short, 2 = long).  */
	13,			                    /* bitsize.  */
	FALSE,			                /* pc_relative.  */
	8,			                    /* bitpos.  */
	complain_overflow_signed,       /* complain_on_overflow.  */
	NULL,		                    /* special_function.  */
	"R_ESP32S2ULP_WR_MEM",	        /* name.  */
	FALSE,			                /* partial_inplace.  */
	(0x7ff << 10),				    /* src_mask.  */ // dya-pass - 0
	(0x7ff << 10),		            /* dst_mask.  */
	FALSE),			                /* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_ALUI,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	4,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_ALUI",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ffff << 4),	/* src_mask.  */ // dya-pass - 0
	(0x00ffff << 4),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_WAIT,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_WAIT",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ffff << 0),				/* src_mask.  */ // dya-pass - 0
	(0x00ffff << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_TSENS_CYCLE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	12,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	16,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_TSENS_CYCLE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0xfff << 16),				/* src_mask.  */ // dya-pass - 0
	(0xfff << 16),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_TSENS_DELAY,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	14,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_TSENS_DELAY",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x3fff << 2),				/* src_mask.  */ // dya-pass - 0
	(0x3fff << 2),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_ADC_CYCLE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	8,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_ADC_CYCLE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ffff << 8),				/* src_mask.  */ // dya-pass - 0
	(0x00ffff << 8),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_ADC_SEL,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	1,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	6,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_ADC_SEL",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x1 << 6),				/* src_mask.  */ // dya-pass - 0
	(0x1 << 6),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_ADC_MUX,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	4,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	2,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_ADC_MUX",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x0f << 2),				/* src_mask.  */ // dya-pass - 0
	(0x0f << 2),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_WAKE,		/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	1,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_WAKE",			/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x1 << 0),							/* src_mask.  */ // dya-pass - 0
	(0x1 << 0),					/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_SLEEP,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_unsigned, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_SLEEP",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0xffff << 0),				/* src_mask.  */ // dya-pass - 0
	(0xffff << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_STAGE,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	4,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_STAGE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ff << 4),				/* src_mask.  */ // dya-pass - 0
	(0x00ff << 4),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_JUMPR_STEP,	/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	8,			/* bitsize.  */
	TRUE,			/* pc_relative.  */
	18,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32s2ulp_jumprelr_reloc,	/* special_function.  */
	"R_ESP32S2ULP_JUMPR_STEP",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ff << 18),			  /* src_mask.  */
	(0x00ff << 18),		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */


