espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	HOWTO(R_ESP32S2ULP_JUMPR_THRESH,		/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	NULL,		/* special_function.  */
	"R_ESP32S2ULP_JUMPR_THRESH",	/* name.  */
	FALSE,			/* partial_inplace.  */
	(0x00ffff << 0),				/* src_mask.  */ // dya-pass - 0
	(0x00ffff << 0),		/* dst_mask.  */
	FALSE),			/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_JUMPS_THRESH,		/* type.  */
	0,									/* rightshift.  */
	2,									/* size (0 = byte, 1 = short, 2 = long).  */
	8,									/* bitsize.  */
	FALSE,								/* pc_relative.  */
	0,									/* bitpos.  */
	complain_overflow_signed,			/* complain_on_overflow.  */
	NULL,								/* special_function.  */
	"R_ESP32S2ULP_JUMPS_THRESH",			/* name.  */
	FALSE,								/* partial_inplace.  */
	(0x00ff << 0),									/* src_mask.  */ // dya-pass - 0
	(0x00ff << 0),						/* dst_mask.  */
	FALSE),								/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_REG_RW_HIGH,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	6,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	23,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_REG_RW_HIGH",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x3f << 23),							/* src_mask.  */ // dya-pass - 0
	(0x3f << 23),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_REG_RW_LOW,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	6,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	18,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_REG_RW_LOW",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x3f << 18),				/* src_mask.  */ // dya-pass - 0
	(0x3f << 18),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_REG_RW_ADDR,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	10,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_REG_RW_ADDR",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x3ff << 0),				/* src_mask.  */ // dya-pass - 0
	(0x3ff << 0),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_REG_RW_DATA,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	8,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	10,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_REG_RW_DATA",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x00ff << 10),				/* src_mask.  */ // dya-pass - 0
	(0x00ff << 10),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_I2C_RW_HIGH,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	19,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_I2C_RW_HIGH",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x7 << 19),				/* src_mask.  */ // dya-pass - 0
	(0x7 << 19),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_I2C_RW_LOW,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	16,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_I2C_RW_LOW",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x7 << 16),				/* src_mask.  */ // dya-pass - 0
	(0x7 << 16),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_I2C_RW_ADDR,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	8,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	0,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_I2C_RW_ADDR",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0xff << 0),				/* src_mask.  */ // dya-pass - 0
	(0xff << 0),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_I2C_RW_DATA,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	8,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_I2C_RW_DATA",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0x00ff << 8),				/* src_mask.  */ // dya-pass - 0
	(0x00ff << 8),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_I2C_RW_SEL,	/* type.  */
	0,							/* rightshift.  */
	2,							/* size (0 = byte, 1 = short, 2 = long).  */
	16,							/* bitsize.  */
	FALSE,						/* pc_relative.  */
	22,							/* bitpos.  */
	complain_overflow_unsigned,	/* complain_on_overflow.  */
	NULL,						/* special_function.  */
	"R_ESP32S2ULP_I2C_RW_SEL",		/* name.  */
	FALSE,						/* partial_inplace.  */
	(0xf << 22),				/* src_mask.  */ // dya-pass - 0
	(0xf << 22),				/* dst_mask.  */
	FALSE),						/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_WR_MEM_LABEL,/* type.  */
	0,			                    /* rightshift.  */
	2,			                    /* size (0 = byte, 1 = short, 2 = long).  */
	2,			                    /* bitsize.  */
	FALSE,			                /* pc_relative.  */
	4,			                    /* bitpos.  */
	complain_overflow_unsigned,     /* complain_on_overflow.  */
	NULL,		                    /* special_function.  */
	"R_ESP32S2ULP_WR_MEM_LABEL",	/* name.  */
	FALSE,			                /* partial_inplace.  */
	(0x3 << 4),                     /* src_mask.  */ // dya-pass - 0
	(0x3 << 4),	                    /* dst_mask.  */
	FALSE),			                /* pcrel_offset.  */

	HOWTO(R_BFD_RELOC_32,           /* type.  */
	0,			                    /* rightshift.  */
	2,			                    /* size (0 = byte, 1 = short, 2 = long).  */
	32,			                    /* bitsize.  */
	FALSE,			                /* pc_relative.  */
	0,			                    /* bitpos.  */
	complain_overflow_bitfield,     /* complain_on_overflow.  */
	NULL,		                    /* special_function.  */
	"32",	                        /* name.  */
	FALSE,			                /* partial_inplace.  */
	0xffffffff,                     /* src_mask.  */ // dya-pass - 0
	0xffffffff,	                    /* dst_mask.  */
	FALSE),			                /* pcrel_offset.  */


	HOWTO(R_ESP32S2ULP_RESERVE,	/* type.  */
	0,			/* rightshift.  */
	2,			/* size (0 = byte, 1 = short, 2 = long).  */
	8,			/* bitsize.  */
	TRUE,			/* pc_relative.  */
	17,			/* bitpos.  */
	complain_overflow_signed, /* complain_on_overflow.  */
	esp32s2ulp_bfd_reloc,	/* special_function.  */
	"R_ESP32S2ULP_RESERVE",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0x01fe0000,		/* src_mask.  */
	0x01fe0000,		/* dst_mask.  */
	TRUE),			/* pcrel_offset.  */
};

