espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
static reloc_howto_type esp32s2ulp_gnuext_howto_table[] =
{
	HOWTO(R_ESP32S2ULP_PLTPC,		/* type.  */
	0,			/* rightshift.  */
	1,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_bitfield, /* complain_on_overflow.  */
	esp32s2ulp_pltpc_reloc,	/* special_function.  */
	"R_ESP32S2ULP_PLTPC",	/* name.  */
	FALSE,			/* partial_inplace.  */
	0xffff,		/* src_mask.  */
	0xffff,		/* dst_mask.  */
	FALSE),		/* pcrel_offset.  */

	HOWTO(R_ESP32S2ULP_GOT,		/* type.  */
	0,			/* rightshift.  */
	1,			/* size (0 = byte, 1 = short, 2 = long).  */
	16,			/* bitsize.  */
	FALSE,			/* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_bitfield, /* complain_on_overflow.  */
	bfd_elf_generic_reloc,	/* special_function.  */
	"R_ESP32S2ULP_GOT",		/* name.  */
	FALSE,			/* partial_inplace.  */
	0x7fff,		/* src_mask.  */
	0x7fff,		/* dst_mask.  */
	FALSE),		/* pcrel_offset.  */

	/* GNU extension to record C++ vtable hierarchy.  */
	HOWTO(R_ESP32S2ULP_GNU_VTINHERIT, /* type.  */
	0,                     /* rightshift.  */
	2,                     /* size (0 = byte, 1 = short, 2 = long).  */
	0,                     /* bitsize.  */
	FALSE,                 /* pc_relative.  */
	0,                     /* bitpos.  */
	complain_overflow_dont, /* complain_on_overflow.  */
	NULL,                  /* special_function.  */
	"R_ESP32S2ULP_GNU_VTINHERIT", /* name.  */
	FALSE,                 /* partial_inplace.  */
	0,                     /* src_mask.  */
	0,                     /* dst_mask.  */
	FALSE),                /* pcrel_offset.  */

	/* GNU extension to record C++ vtable member usage.  */
	HOWTO(R_ESP32S2ULP_GNU_VTENTRY,	/* type.  */
	0,                     /* rightshift.  */
	2,                     /* size (0 = byte, 1 = short, 2 = long).  */
	0,                     /* bitsize.  */
	FALSE,                 /* pc_relative.  */
	0,			/* bitpos.  */
	complain_overflow_dont, /* complain_on_overflow.  */
	_bfd_elf_rel_vtable_reloc_fn, /* special_function.  */
	"R_ESP32S2ULP_GNU_VTENTRY",	/* name.  */
	FALSE,                 /* partial_inplace.  */
	0,                     /* src_mask.  */
	0,                     /* dst_mask.  */
	FALSE)                 /* pcrel_offset.  */
};

struct esp32s2ulp_reloc_map
{
	bfd_reloc_code_real_type 	bfd_reloc_val;
	unsigned int			esp32s2ulp_reloc_val;
};

static const struct esp32s2ulp_reloc_map esp32s2ulp_reloc_map[] =
{
	{ BFD_RELOC_NONE, R_ESP32S2ULP_UNUSED0 },
	{ BFD_RELOC_ESP32S2ULP_16_IMM, R_ESP32S2ULP_RIMM16 },
	{ BFD_RELOC_ESP32S2ULP_JUMPR, R_ESP32S2ULP_JUMPR },
	{ BFD_RELOC_ESP32S2ULP_16_LOAD, R_ESP32S2ULP_LOAD16 },
	{ BFD_RELOC_ESP32S2ULP_WR_MEM, R_ESP32S2ULP_WR_MEM },
	{ BFD_RELOC_ESP32S2ULP_ALUI, R_ESP32S2ULP_ALUI },
	{ BFD_RELOC_ESP32S2ULP_WAIT, R_ESP32S2ULP_WAIT },
	{ BFD_RELOC_ESP32S2ULP_TSENS_CYCLE, R_ESP32S2ULP_TSENS_CYCLE },
	{ BFD_RELOC_ESP32S2ULP_TSENS_DELAY, R_ESP32S2ULP_TSENS_DELAY },

	{ BFD_RELOC_ESP32S2ULP_ADC_CYCLE, R_ESP32S2ULP_ADC_CYCLE },
	{ BFD_RELOC_ESP32S2ULP_ADC_SEL, R_ESP32S2ULP_ADC_SEL },
	{ BFD_RELOC_ESP32S2ULP_ADC_MUX, R_ESP32S2ULP_ADC_MUX },
	{ BFD_RELOC_ESP32S2ULP_WAKE, R_ESP32S2ULP_WAKE },
	{ BFD_RELOC_ESP32S2ULP_SLEEP, R_ESP32S2ULP_SLEEP },

	{ BFD_RELOC_ESP32S2ULP_STAGE, R_ESP32S2ULP_STAGE },

	{ BFD_RELOC_ESP32S2ULP_JUMPR_STEP, R_ESP32S2ULP_JUMPR_STEP },
	{ BFD_RELOC_ESP32S2ULP_JUMPR_THRESH, R_ESP32S2ULP_JUMPR_THRESH },
	{ BFD_RELOC_ESP32S2ULP_JUMPS_THRESH, R_ESP32S2ULP_JUMPS_THRESH },

	{ BFD_RELOC_ESP32S2ULP_REG_RW_HIGH, R_ESP32S2ULP_REG_RW_HIGH },
	{ BFD_RELOC_ESP32S2ULP_REG_RW_LOW, R_ESP32S2ULP_REG_RW_LOW },
	{ BFD_RELOC_ESP32S2ULP_REG_RW_ADDR, R_ESP32S2ULP_REG_RW_ADDR },
	{ BFD_RELOC_ESP32S2ULP_REG_RW_DATA, R_ESP32S2ULP_REG_RW_DATA },

	{ BFD_RELOC_ESP32S2ULP_I2C_RW_HIGH, R_ESP32S2ULP_I2C_RW_HIGH },
	{ BFD_RELOC_ESP32S2ULP_I2C_RW_LOW, R_ESP32S2ULP_I2C_RW_LOW },
	{ BFD_RELOC_ESP32S2ULP_I2C_RW_ADDR, R_ESP32S2ULP_I2C_RW_ADDR },
	{ BFD_RELOC_ESP32S2ULP_I2C_RW_DATA, R_ESP32S2ULP_I2C_RW_DATA },
	{ BFD_RELOC_ESP32S2ULP_I2C_RW_SEL, R_ESP32S2ULP_I2C_RW_SEL },

	{ BFD_RELOC_ESP32S2ULP_WR_MEM_LABEL, R_ESP32S2ULP_WR_MEM_LABEL },

	{ BFD_RELOC_32, R_BFD_RELOC_32 },

	{ BFD_RELOC_ESP32S2ULP_RESERVE, R_ESP32S2ULP_RESERVE },

	{ BFD_RELOC_ESP32S2ULP_GOT, R_ESP32S2ULP_GOT },
	{ BFD_RELOC_ESP32S2ULP_PLTPC, R_ESP32S2ULP_PLTPC },

	{ BFD_RELOC_VTABLE_INHERIT, R_ESP32S2ULP_GNU_VTINHERIT },
	{ BFD_RELOC_VTABLE_ENTRY, R_ESP32S2ULP_GNU_VTENTRY },
};


static void
esp32s2ulp_info_to_howto(bfd *abfd ATTRIBUTE_UNUSED,
arelent *cache_ptr,
Elf_Internal_Rela *dst)
{
	unsigned int r_type;

	r_type = ELF32_R_TYPE(dst->r_info);

	if (r_type <= ESP32S2ULP_RELOC_MAX)
		cache_ptr->howto = &esp32s2ulp_howto_table[r_type];

	else if (r_type >= ESP32S2ULP_GNUEXT_RELOC_MIN && r_type <= ESP32S2ULP_GNUEXT_RELOC_MAX)
		cache_ptr->howto = &esp32s2ulp_gnuext_howto_table[r_type - ESP32S2ULP_GNUEXT_RELOC_MIN];

	else
		cache_ptr->howto = (reloc_howto_type *)NULL;
}

/* Given a BFD reloc type, return the howto.  */
static reloc_howto_type *
esp32s2ulp_bfd_reloc_type_lookup(bfd * abfd ATTRIBUTE_UNUSED,
bfd_reloc_code_real_type code)
{
	unsigned int i;
	unsigned int r_type = (unsigned int)-1;

	for (i = sizeof(esp32s2ulp_reloc_map) / sizeof(esp32s2ulp_reloc_map[0]); i--;)
		if (esp32s2ulp_reloc_map[i].bfd_reloc_val == code)
			r_type = esp32s2ulp_reloc_map[i].esp32s2ulp_reloc_val;

	if (r_type <= ESP32S2ULP_RELOC_MAX)
		return &esp32s2ulp_howto_table[r_type];

	else if (r_type >= ESP32S2ULP_GNUEXT_RELOC_MIN && r_type <= ESP32S2ULP_GNUEXT_RELOC_MAX)
		return &esp32s2ulp_gnuext_howto_table[r_type - ESP32S2ULP_GNUEXT_RELOC_MIN];

	return (reloc_howto_type *)NULL;
}

static reloc_howto_type *
esp32s2ulp_bfd_reloc_name_lookup(bfd *abfd ATTRIBUTE_UNUSED,
const char *r_name)
{
	unsigned int i;

	for (i = 0;
		i < (sizeof(esp32s2ulp_howto_table)
		/ sizeof(esp32s2ulp_howto_table[0]));
	i++)
		if (esp32s2ulp_howto_table[i].name != NULL
			&& strcasecmp(esp32s2ulp_howto_table[i].name, r_name) == 0)
			return &esp32s2ulp_howto_table[i];

	for (i = 0;
		i < (sizeof(esp32s2ulp_gnuext_howto_table)
		/ sizeof(esp32s2ulp_gnuext_howto_table[0]));
	i++)
		if (esp32s2ulp_gnuext_howto_table[i].name != NULL
			&& strcasecmp(esp32s2ulp_gnuext_howto_table[i].name, r_name) == 0)
			return &esp32s2ulp_gnuext_howto_table[i];

