espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	return NULL;
}

/* Given a esp32s2ulp relocation type, return the howto.  */
static reloc_howto_type *
esp32s2ulp_reloc_type_lookup(bfd * abfd ATTRIBUTE_UNUSED,
unsigned int r_type)
{
	if (r_type <= ESP32S2ULP_RELOC_MAX)
		return &esp32s2ulp_howto_table[r_type];

	else if (r_type >= ESP32S2ULP_GNUEXT_RELOC_MIN && r_type <= ESP32S2ULP_GNUEXT_RELOC_MAX)
		return &esp32s2ulp_gnuext_howto_table[r_type - ESP32S2ULP_GNUEXT_RELOC_MIN];

	return (reloc_howto_type *)NULL;
}
//
///* Set by ld emulation if --code-in-l1.  */
//bfd_boolean elf32_esp32s2ulp_code_in_l1 = 0;
//
///* Set by ld emulation if --data-in-l1.  */
//bfd_boolean elf32_esp32s2ulp_data_in_l1 = 0;

static void
elf32_esp32s2ulp_final_write_processing(bfd *abfd,
bfd_boolean linker ATTRIBUTE_UNUSED)
{
	(void)abfd;
	(void)linker;
}

/* Return TRUE if the name is a local label.
esp32s2ulp local labels begin with L$.  */
static bfd_boolean
esp32s2ulp_is_local_label_name(bfd *abfd, const char *label)
{
	if (label[0] == 'L' && label[1] == '$')
		return TRUE;

	return _bfd_elf_is_local_label_name(abfd, label);
}

/* Look through the relocs for a section during the first phase, and
allocate space in the global offset table or procedure linkage
table.  */

static bfd_boolean
esp32s2ulp_check_relocs(bfd * abfd,
struct bfd_link_info *info,
	asection *sec,
	const Elf_Internal_Rela *relocs)
{
	bfd *dynobj;
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_signed_vma *local_got_refcounts;
	const Elf_Internal_Rela *rel;
	const Elf_Internal_Rela *rel_end;
	asection *sgot;
	asection *srelgot;

	if (bfd_link_relocatable(info))
		return TRUE;

	dynobj = elf_hash_table(info)->dynobj;
	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);
	local_got_refcounts = elf_local_got_refcounts(abfd);

	sgot = NULL;
	srelgot = NULL;

	rel_end = relocs + sec->reloc_count;
	for (rel = relocs; rel < rel_end; rel++)
	{
		unsigned long r_symndx;
		struct elf_link_hash_entry *h;

		r_symndx = ELF32_R_SYM(rel->r_info);
		if (r_symndx < symtab_hdr->sh_info)
			h = NULL;
		else
		{
			h = sym_hashes[r_symndx - symtab_hdr->sh_info];

			/* PR15323, ref flags aren't set for references in the same
			object.  */
			h->root.non_ir_ref = 1;
		}

		switch (ELF32_R_TYPE(rel->r_info))
		{
			/* This relocation describes the C++ object vtable hierarchy.
			Reconstruct it for later use during GC.  */
		case R_ESP32S2ULP_GNU_VTINHERIT:
			if (!bfd_elf_gc_record_vtinherit(abfd, sec, h, rel->r_offset))
				return FALSE;
			break;

			/* This relocation describes which C++ vtable entries
			are actually used.  Record for later use during GC.  */
		case R_ESP32S2ULP_GNU_VTENTRY:
			BFD_ASSERT(h != NULL);
			if (h != NULL
				&& !bfd_elf_gc_record_vtentry(abfd, sec, h, rel->r_addend))
				return FALSE;
			break;

		case R_ESP32S2ULP_GOT:
			if (h != NULL
				&& strcmp(h->root.root.string, "__GLOBAL_OFFSET_TABLE_") == 0)
				break;
			/* Fall through.  */

			if (dynobj == NULL)
			{
				/* Create the .got section.  */
				elf_hash_table(info)->dynobj = dynobj = abfd;
				if (!_bfd_elf_create_got_section(dynobj, info))
					return FALSE;
			}

			sgot = elf_hash_table(info)->sgot;
			srelgot = elf_hash_table(info)->srelgot;
			BFD_ASSERT(sgot != NULL);

			if (h != NULL)
			{
				if (h->got.refcount == 0)
				{
					/* Make sure this symbol is output as a dynamic symbol.  */
					if (h->dynindx == -1 && !h->forced_local)
					{
						if (!bfd_elf_link_record_dynamic_symbol(info, h))
							return FALSE;
					}

					/* Allocate space in the .got section.  */
					sgot->size += 4;
					/* Allocate relocation space.  */
					srelgot->size += sizeof(Elf32_External_Rela);
				}
				h->got.refcount++;
			}
			else
			{
				/* This is a global offset table entry for a local symbol.  */
				if (local_got_refcounts == NULL)
				{
					bfd_size_type size;

					size = symtab_hdr->sh_info;
					size *= sizeof(bfd_signed_vma);
					local_got_refcounts = ((bfd_signed_vma *)
						bfd_zalloc(abfd, size));
					if (local_got_refcounts == NULL)
						return FALSE;
					elf_local_got_refcounts(abfd) = local_got_refcounts;
				}
				if (local_got_refcounts[r_symndx] == 0)
				{
					sgot->size += 4;
					if (bfd_link_pic(info))
					{
						/* If we are generating a shared object, we need to
						output a R_68K_RELATIVE reloc so that the dynamic
						linker can adjust this GOT entry.  */
						srelgot->size += sizeof(Elf32_External_Rela);
					}
				}
				local_got_refcounts[r_symndx]++;
			}
			break;

		default:
			break;
		}
	}

	return TRUE;
}

static enum elf_reloc_type_class
elf32_esp32s2ulp_reloc_type_class(const struct bfd_link_info *info ATTRIBUTE_UNUSED,
const asection *rel_sec ATTRIBUTE_UNUSED,
const Elf_Internal_Rela * rela)
{
	switch ((int)ELF32_R_TYPE(rela->r_info))
	{
	default:
		return reloc_class_normal;
	}
}

static bfd_reloc_status_type
esp32s2ulp_final_link_relocate(Elf_Internal_Rela *rel, reloc_howto_type *howto,
bfd *input_bfd, asection *input_section,
bfd_byte *contents, bfd_vma address,
bfd_vma value, bfd_vma addend)
{
	int r_type = ELF32_R_TYPE(rel->r_info);
	//DEBUG_TRACE("dya_pass - esp32s2ulp_final_link_relocate r_type=%i, addend=%i\n", r_type, (unsigned int)addend);
	if ((r_type == R_ESP32S2ULP_JUMPR) || (r_type == R_ESP32S2ULP_JUMPR_STEP))
	{
		bfd_reloc_status_type r = bfd_reloc_ok;

		if (address > bfd_get_section_limit(input_bfd, input_section))
			return bfd_reloc_outofrange;

		value = value << 2;
		//printf("intput value = %i, ", (int)value);
		value += addend;

		/* Perform usual pc-relative correction.  */
		value -= input_section->output_section->vma + input_section->output_offset;
		value -= address;
		
		Elf_Internal_Shdr * symtab_hdr = &elf_tdata(input_bfd)->symtab_hdr;

		unsigned long r_symndx = ELF32_R_SYM(rel->r_info);

		unsigned int ddd = 0;
		memcpy(&ddd, contents + address, 4);
		ddd &= ~(0xff << 18);
		int compare = (int)value;
		compare = compare >> 2;
		//printf("final reloc, compare=%i, value=%i, addend=%i, address=%i, vma=%i, flags=%08x, r_symndx=%08x, symtab_hdr->sh_info=%08x\n", compare, (unsigned int)value, (unsigned int)addend, (unsigned int)address, (unsigned int)input_section->output_section->vma, (unsigned int)input_section->flags, (unsigned int)r_symndx, (unsigned int)symtab_hdr->sh_info);
		if (r_symndx >= symtab_hdr->sh_info) // Apply only for global symbols
		{
			if ((compare > 127) || (compare < -128))
			{
				return bfd_reloc_outofrange;
			}
//            ddd |= ((compare & 0x000000ff) << 18);
			if ((compare) >= 0)
			{
				ddd |= ((compare & 0x0000007f) << 18);
			}
			else
			{
				compare = -compare;
				ddd |= ((compare & 0x0000007f) << 18) | (1 << 25);
			}
			memcpy(contents + address, &ddd, 4);
		}
		//DEBUG_TRACE("dya_pass - esp32s2ulp_final_link_relocate: ddd=%08x, value=%08x, addr=%08x\n", ddd, (int)value, (int)address);
		return r;
	}

