espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	return _bfd_final_link_relocate(howto, input_bfd, input_section, contents,
		rel->r_offset, value, addend);

}


#define ESP32S2ULP_RELOC_FOR_GLOBAL_SYMBOL(info, input_bfd, input_section, rel,	\
				r_symndx, symtab_hdr, sym_hashes,	\
				h, sec, relocation,			\
				unresolved_reloc, warned, ignored, sectioin_flags)	\
  do									\
          {									\
      /* It seems this can happen with erroneous or unsupported		\
   	 input (mixing a.out and elf in an archive, for example.)  */	\
      if (sym_hashes == NULL)						\
	return FALSE;							\
									\
      h = sym_hashes[r_symndx - symtab_hdr->sh_info];			\
									\
      if (info->wrap_hash != NULL					\
	  && (input_section->flags & SEC_DEBUGGING) != 0)		\
	h = ((struct elf_link_hash_entry *)				\
	     unwrap_hash_lookup (info, input_bfd, &h->root));		\
									\
																											      while (h->root.type == bfd_link_hash_indirect			\
	     || h->root.type == bfd_link_hash_warning)			\
	h = (struct elf_link_hash_entry *) h->root.u.i.link;		\
									\
      warned = FALSE;							\
      ignored = FALSE;							\
      unresolved_reloc = FALSE;						\
      relocation = 0;							\
      if (h->root.type == bfd_link_hash_defined				\
	  || h->root.type == bfd_link_hash_defweak)			\
	  	  	  	{								\
	  sec = h->root.u.def.section;					\
	  if (sec == NULL						\
	      || sec->output_section == NULL)				\
	    /* Set a flag that will be cleared later if we find a	\
   	       relocation value for this symbol.  output_section	\
   	       is typically NULL for symbols satisfied by a shared	\
   	       library.  */						\
	    unresolved_reloc = TRUE;					\
				  		  	  	  else								\
			/*DEBUG_TRACE("ESP32S2ULP_RELOC_FOR_GLOBAL_SYMBOL - value = %08x, output_section->vma = %08x, sec->output_offset = %08x, sec->size = %08x, flags=%08x\n", (unsigned int)h->root.u.def.value, (unsigned int)sec->output_section->vma,  (unsigned int)sec->output_offset, (unsigned int)sec->output_section->rawsize, (unsigned int)sec->flags);*/ \
	    relocation = (h->root.u.def.value				\
			  + sec->output_section->vma    			\
			  + sec->output_offset);											\
			  sectioin_flags = sec->flags;										\
	  	}																		\
	        else if (h->root.type == bfd_link_hash_undefweak)					\
	;																			\
	        else if (info->unresolved_syms_in_objects == RM_IGNORE		\
	       && ELF_ST_VISIBILITY (h->other) == STV_DEFAULT)		\
	ignored = TRUE;							\
	        else if (!bfd_link_relocatable (info))				\
	{								\
	  bfd_boolean err;						\
	  err = (info->unresolved_syms_in_objects == RM_GENERATE_ERROR	\
		 || ELF_ST_VISIBILITY (h->other) != STV_DEFAULT);	\
	  (*info->callbacks->undefined_symbol) (info,			\
						h->root.root.string,	\
						input_bfd,		\
						input_section,		\
						rel->r_offset, err);	\
	  warned = TRUE;						\
	}								\
      (void) unresolved_reloc;						\
      (void) warned;							\
      (void) ignored;							\
      }									\
	    while (0)








static bfd_boolean
esp32s2ulp_relocate_section(bfd * output_bfd,
struct bfd_link_info *info,
	bfd * input_bfd,
	asection * input_section,
	bfd_byte * contents,
	Elf_Internal_Rela * relocs,
	Elf_Internal_Sym * local_syms,
	asection ** local_sections)
{
	bfd *dynobj;
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_vma *local_got_offsets;
	asection *sgot;
	Elf_Internal_Rela *rel;
	Elf_Internal_Rela *relend;
	int i = 0;

	dynobj = elf_hash_table(info)->dynobj;
	symtab_hdr = &elf_tdata(input_bfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(input_bfd);
	local_got_offsets = elf_local_got_offsets(input_bfd);

	sgot = NULL;

	rel = relocs;
	relend = relocs + input_section->reloc_count;
	//DEBUG_TRACE("dya_pass - esp32s2ulp_relocate_section\n");
	for (; rel < relend; rel++, i++)
	{
		int r_type;
		reloc_howto_type *howto;
		unsigned long r_symndx;
		struct elf_link_hash_entry *h;
		Elf_Internal_Sym *sym;
		asection *sec;
		bfd_vma relocation = 0;
		//bfd_vma old_reloc = relocation;
		bfd_boolean unresolved_reloc;
		bfd_reloc_status_type r;
		bfd_vma address;

		r_type = ELF32_R_TYPE(rel->r_info);
		if (r_type < 0 || r_type >= 243)
		{
			bfd_set_error(bfd_error_bad_value);
			return FALSE;
		}

		if (r_type == R_ESP32S2ULP_GNU_VTENTRY
			|| r_type == R_ESP32S2ULP_GNU_VTINHERIT)
			continue;

		howto = esp32s2ulp_reloc_type_lookup(input_bfd, r_type);
		if (howto == NULL)
		{
			bfd_set_error(bfd_error_bad_value);
			return FALSE;
		}
		r_symndx = ELF32_R_SYM(rel->r_info);

		h = NULL;
		sym = NULL;
		sec = NULL;
		unresolved_reloc = FALSE;
		
		unsigned int section_flags = 0;

		if (r_symndx < symtab_hdr->sh_info)
		{
			sym = local_syms + r_symndx;
			sec = local_sections[r_symndx];
			relocation = _bfd_elf_rela_local_sym(output_bfd, sym, &sec, rel);
			section_flags = sec->flags;
		}
		else
		{
			bfd_boolean warned, ignored;
			ESP32S2ULP_RELOC_FOR_GLOBAL_SYMBOL(info, input_bfd, input_section, rel,
				r_symndx, symtab_hdr, sym_hashes,
				h, sec, relocation,
				unresolved_reloc, warned, ignored, section_flags);
		}

		if (sec != NULL && discarded_section(sec))
			RELOC_AGAINST_DISCARDED_SECTION(info, input_bfd, input_section,
			rel, 1, relend, howto, 0, contents);

		if (bfd_link_relocatable(info))
			continue;

		address = rel->r_offset;

		/* Then, process normally.  */
		//DEBUG_TRACE("dya_pass - esp32s2ulp_relocate_section r_type=%i\n", (int)r_type);
		switch (r_type)
		{
		case R_ESP32S2ULP_GNU_VTINHERIT:
		case R_ESP32S2ULP_GNU_VTENTRY:
			return bfd_reloc_ok;

		case R_ESP32S2ULP_GOT:
			/* Relocation is to the address of the entry for this symbol
			in the global offset table.  */
			if (h != NULL
				&& strcmp(h->root.root.string, "__GLOBAL_OFFSET_TABLE_") == 0)
				goto do_default;
			/* Fall through.  */
			/* Relocation is the offset of the entry for this symbol in
			the global offset table.  */

			{
				bfd_vma off;

				if (dynobj == NULL)
				{
					/* Create the .got section.  */
					elf_hash_table(info)->dynobj = dynobj = output_bfd;
					if (!_bfd_elf_create_got_section(dynobj, info))
						return FALSE;
				}

				sgot = elf_hash_table(info)->sgot;
				BFD_ASSERT(sgot != NULL);

				if (h != NULL)
				{
					bfd_boolean dyn;

					off = h->got.offset;
					BFD_ASSERT(off != (bfd_vma)-1);
					dyn = elf_hash_table(info)->dynamic_sections_created;

					if (!WILL_CALL_FINISH_DYNAMIC_SYMBOL(dyn,
						bfd_link_pic(info),
						h)
						|| (bfd_link_pic(info)
						&& (info->symbolic
						|| h->dynindx == -1
						|| h->forced_local)
						&& h->def_regular))
					{
						/* This is actually a static link, or it is a
						-Bsymbolic link and the symbol is defined
						locally, or the symbol was forced to be local
						because of a version file..  We must initialize
						this entry in the global offset table.  Since
						the offset must always be a multiple of 4, we
						use the least significant bit to record whether
						we have initialized it already.

