espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
						When doing a dynamic link, we create a .rela.got
						relocation entry to initialize the value.  This
						is done in the finish_dynamic_symbol routine.  */
						if ((off & 1) != 0)
							off &= ~1;
						else
						{
							bfd_put_32(output_bfd, relocation,
								sgot->contents + off);
							h->got.offset |= 1;
						}
					}
					else
						unresolved_reloc = FALSE;
				}
				else
				{
					BFD_ASSERT(local_got_offsets != NULL);
					off = local_got_offsets[r_symndx];
					BFD_ASSERT(off != (bfd_vma)-1);

					/* The offset must always be a multiple of 4.  We use
					the least significant bit to record whether we have
					already generated the necessary reloc.  */
					if ((off & 1) != 0)
						off &= ~1;
					else
					{
						bfd_put_32(output_bfd, relocation, sgot->contents + off);

						if (bfd_link_pic(info))
						{
							asection *s;
							Elf_Internal_Rela outrel;
							bfd_byte *loc;

							s = elf_hash_table(info)->srelgot;
							BFD_ASSERT(s != NULL);

							outrel.r_offset = (sgot->output_section->vma
								+ sgot->output_offset + off);
							outrel.r_info =
								ELF32_R_INFO(0, R_ESP32S2ULP_RIMM16);
							outrel.r_addend = relocation;
							loc = s->contents;
							loc +=
								s->reloc_count++ * sizeof(Elf32_External_Rela);
							bfd_elf32_swap_reloca_out(output_bfd, &outrel, loc);
						}

						local_got_offsets[r_symndx] |= 1;
					}
				}

				relocation = sgot->output_offset + off;
				rel->r_addend = 0;
				/* esp32s2ulp : preg = [preg + 17bitdiv4offset] relocation is div by 4.  */
				relocation /= 4;
			}
			goto do_default;

		default:
		do_default :
				//DEBUG_TRACE("dya_pass esp32s2ulp_final_link_relocate rel->r_addend=%i\n", (int)rel->r_addend);
//				old_reloc = (unsigned int)relocation;
				if (section_flags != 0) relocation = relocation >> 2;
//				printf("relocation - 999 = %08x, old_reloc = %08x, input_section->flags = %08x, section name = %s\n", (unsigned int)relocation, (unsigned int)old_reloc, section_flags, input_section->name);
				   rel->r_addend = 0; // dya_pass
				   r = esp32s2ulp_final_link_relocate(rel, howto, input_bfd, input_section,
					   contents, address,
					   relocation, rel->r_addend);

				   break;
		}

		/* Dynamic relocs are not propagated for SEC_DEBUGGING sections
		because such sections are not SEC_ALLOC and thus ld.so will
		not process them.  */
		if (unresolved_reloc
			&& !((input_section->flags & SEC_DEBUGGING) != 0 && h->def_dynamic)
			&& _bfd_elf_section_offset(output_bfd, info, input_section,
			rel->r_offset) != (bfd_vma)-1)
		{
			_bfd_error_handler
				/* xgettext:c-format */
				(_("%B(%A+0x%lx): unresolvable relocation against symbol `%s'"),
				input_bfd,
				input_section, (long)rel->r_offset, h->root.root.string);
			return FALSE;
		}

		if (r != bfd_reloc_ok)
		{
			const char *name;

			if (h != NULL)
				name = h->root.root.string;
			else
			{
				name = bfd_elf_string_from_elf_section(input_bfd,
					symtab_hdr->sh_link,
					sym->st_name);
				if (name == NULL)
					return FALSE;
				if (*name == '\0')
					name = bfd_section_name(input_bfd, sec);
			}

			if (r == bfd_reloc_overflow)
				(*info->callbacks->reloc_overflow)
				(info, (h ? &h->root : NULL), name, howto->name,
				(bfd_vma)0, input_bfd, input_section, rel->r_offset);
			else
			{
				_bfd_error_handler
					/* xgettext:c-format */
					(_("%B(%A+0x%lx): reloc against `%s': error %d"),
					input_bfd, input_section,
					(long)rel->r_offset, name, (int)r);
				return FALSE;
			}
		}
	}

	return TRUE;
}

static asection *
esp32s2ulp_gc_mark_hook(asection * sec,
struct bfd_link_info *info,
	Elf_Internal_Rela * rel,
struct elf_link_hash_entry *h,
	Elf_Internal_Sym * sym)
{
	if (h != NULL)
		switch (ELF32_R_TYPE(rel->r_info))
	{
		case R_ESP32S2ULP_GNU_VTINHERIT:
		case R_ESP32S2ULP_GNU_VTENTRY:
			return NULL;
	}

	return _bfd_elf_gc_mark_hook(sec, info, rel, h, sym);
}

/* Update the got entry reference counts for the section being removed.  */

static bfd_boolean
esp32s2ulp_gc_sweep_hook(bfd * abfd,
struct bfd_link_info *info,
	asection * sec,
	const Elf_Internal_Rela * relocs)
{
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	bfd_signed_vma *local_got_refcounts;
	const Elf_Internal_Rela *rel, *relend;
	bfd *dynobj;
	asection *sgot;
	asection *srelgot;

	dynobj = elf_hash_table(info)->dynobj;
	if (dynobj == NULL)
		return TRUE;

	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);
	local_got_refcounts = elf_local_got_refcounts(abfd);

	sgot = elf_hash_table(info)->sgot;
	srelgot = elf_hash_table(info)->srelgot;

	relend = relocs + sec->reloc_count;
	for (rel = relocs; rel < relend; rel++)
	{
		unsigned long r_symndx;
		struct elf_link_hash_entry *h;

		switch (ELF32_R_TYPE(rel->r_info))
		{
		case R_ESP32S2ULP_GOT:
			r_symndx = ELF32_R_SYM(rel->r_info);
			if (r_symndx >= symtab_hdr->sh_info)
			{
				h = sym_hashes[r_symndx - symtab_hdr->sh_info];
				if (h->got.refcount > 0)
				{
					--h->got.refcount;
					if (h->got.refcount == 0)
					{
						/* We don't need the .got entry any more.  */
						sgot->size -= 4;
						srelgot->size -= sizeof(Elf32_External_Rela);
					}
				}
			}
			else if (local_got_refcounts != NULL)
			{
				if (local_got_refcounts[r_symndx] > 0)
				{
					--local_got_refcounts[r_symndx];
					if (local_got_refcounts[r_symndx] == 0)
					{
						/* We don't need the .got entry any more.  */
						sgot->size -= 4;
						if (bfd_link_pic(info))
							srelgot->size -= sizeof(Elf32_External_Rela);
					}
				}
			}
			break;
		default:
			break;
		}
	}
	return TRUE;
}

extern const bfd_target esp32s2ulp_elf32_fdpic_vec;
#define IS_FDPIC(bfd) ((bfd)->xvec == &esp32s2ulp_elf32_fdpic_vec)

/* An extension of the elf hash table data structure,
containing some additional Blackfin-specific data.  */
struct esp32s2ulpfdpic_elf_link_hash_table
{
	struct elf_link_hash_table elf;

	/* A pointer to the .rofixup section.  */
	asection *sgotfixup;
	/* GOT base offset.  */
	bfd_vma got0;
	/* Location of the first non-lazy PLT entry, i.e., the number of
	bytes taken by lazy PLT entries.  */
	bfd_vma plt0;
	/* A hash table holding information about which symbols were
	referenced with which PIC-related relocations.  */
	struct htab *relocs_info;
	/* Summary reloc information collected by
	_esp32s2ulpfdpic_count_got_plt_entries.  */
	struct _esp32s2ulpfdpic_dynamic_got_info *g;
};

