espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
/* Get the Blackfin ELF linker hash table from a link_info structure.  */

#define esp32s2ulpfdpic_hash_table(info) \
  (elf_hash_table_id ((struct elf_link_hash_table *) ((info)->hash)) \
  == ESP32S2ULP_ELF_DATA ? ((struct esp32s2ulpfdpic_elf_link_hash_table *) ((info)->hash)) : NULL)

#define esp32s2ulpfdpic_got_section(info) \
  (esp32s2ulpfdpic_hash_table (info)->elf.sgot)
#define esp32s2ulpfdpic_gotrel_section(info) \
  (esp32s2ulpfdpic_hash_table (info)->elf.srelgot)
#define esp32s2ulpfdpic_gotfixup_section(info) \
  (esp32s2ulpfdpic_hash_table (info)->sgotfixup)
#define esp32s2ulpfdpic_plt_section(info) \
  (esp32s2ulpfdpic_hash_table (info)->elf.splt)
#define esp32s2ulpfdpic_pltrel_section(info) \
  (esp32s2ulpfdpic_hash_table (info)->elf.srelplt)
#define esp32s2ulpfdpic_relocs_info(info) \
  (esp32s2ulpfdpic_hash_table (info)->relocs_info)
#define esp32s2ulpfdpic_got_initial_offset(info) \
  (esp32s2ulpfdpic_hash_table (info)->got0)
#define esp32s2ulpfdpic_plt_initial_offset(info) \
  (esp32s2ulpfdpic_hash_table (info)->plt0)
#define esp32s2ulpfdpic_dynamic_got_plt_info(info) \
  (esp32s2ulpfdpic_hash_table (info)->g)

/* The name of the dynamic interpreter.  This is put in the .interp
section.  */

#define ELF_DYNAMIC_INTERPRETER "/lib/ld.so.1"

#define DEFAULT_STACK_SIZE 0x20000

/* This structure is used to collect the number of entries present in
each addressable range of the got.  */
struct _esp32s2ulpfdpic_dynamic_got_info
{
	/* Several bits of information about the current link.  */
	struct bfd_link_info *info;
	/* Total size needed for GOT entries within the 18- or 32-bit
	ranges.  */
	bfd_vma got17m4, gothilo;
	/* Total size needed for function descriptor entries within the 18-
	or 32-bit ranges.  */
	bfd_vma fd17m4, fdhilo;
	/* Total size needed function descriptor entries referenced in PLT
	entries, that would be profitable to place in offsets close to
	the PIC register.  */
	bfd_vma fdplt;
	/* Total size needed by lazy PLT entries.  */
	bfd_vma lzplt;
	/* Number of relocations carried over from input object files.  */
	unsigned long relocs;
	/* Number of fixups introduced by relocations in input object files.  */
	unsigned long fixups;
};

/* Create a Blackfin ELF linker hash table.  */

static struct bfd_link_hash_table *
esp32s2ulpfdpic_elf_link_hash_table_create(bfd *abfd)
{
	struct esp32s2ulpfdpic_elf_link_hash_table *ret;
	bfd_size_type amt = sizeof(struct esp32s2ulpfdpic_elf_link_hash_table);

	ret = bfd_zmalloc(amt);
	if (ret == NULL)
		return NULL;

	if (!_bfd_elf_link_hash_table_init(&ret->elf, abfd,
		_bfd_elf_link_hash_newfunc,
		sizeof(struct elf_link_hash_entry),
		ESP32S2ULP_ELF_DATA))
	{
		free(ret);
		return NULL;
	}

	return &ret->elf.root;
}

/* Decide whether a reference to a symbol can be resolved locally or
not.  If the symbol is protected, we want the local address, but
its function descriptor must be assigned by the dynamic linker.  */
#define ESP32S2ULPFDPIC_SYM_LOCAL(INFO, H) \
  (_bfd_elf_symbol_refs_local_p ((H), (INFO), 1) \
   || ! elf_hash_table (INFO)->dynamic_sections_created)
#define ESP32S2ULPFDPIC_FUNCDESC_LOCAL(INFO, H) \
  ((H)->dynindx == -1 || ! elf_hash_table (INFO)->dynamic_sections_created)

/* This structure collects information on what kind of GOT, PLT or
function descriptors are required by relocations that reference a
certain symbol.  */
struct esp32s2ulpfdpic_relocs_info
{
	/* The index of the symbol, as stored in the relocation r_info, if
	we have a local symbol; -1 otherwise.  */
	long symndx;
	union
	{
		/* The input bfd in which the symbol is defined, if it's a local
		symbol.  */
		bfd *abfd;
		/* If symndx == -1, the hash table entry corresponding to a global
		symbol (even if it turns out to bind locally, in which case it
		should ideally be replaced with section's symndx + addend).  */
		struct elf_link_hash_entry *h;
	} d;
	/* The addend of the relocation that references the symbol.  */
	bfd_vma addend;

	/* The fields above are used to identify an entry.  The fields below
	contain information on how an entry is used and, later on, which
	locations it was assigned.  */
	/* The following 2 fields record whether the symbol+addend above was
	ever referenced with a GOT relocation.  The 17M4 suffix indicates a
	GOT17M4 relocation; hilo is used for GOTLO/GOTHI pairs.  */
	unsigned got17m4;
	unsigned gothilo;
	/* Whether a FUNCDESC relocation references symbol+addend.  */
	unsigned fd;
	/* Whether a FUNCDESC_GOT relocation references symbol+addend.  */
	unsigned fdgot17m4;
	unsigned fdgothilo;
	/* Whether a FUNCDESC_GOTOFF relocation references symbol+addend.  */
	unsigned fdgoff17m4;
	unsigned fdgoffhilo;
	/* Whether symbol+addend is referenced with GOTOFF17M4, GOTOFFLO or
	GOTOFFHI relocations.  The addend doesn't really matter, since we
	envision that this will only be used to check whether the symbol
	is mapped to the same segment as the got.  */
	unsigned gotoff;
	/* Whether symbol+addend is referenced by a LABEL24 relocation.  */
	unsigned call;
	/* Whether symbol+addend is referenced by a 32 or FUNCDESC_VALUE
	relocation.  */
	unsigned sym;
	/* Whether we need a PLT entry for a symbol.  Should be implied by
	something like:
	(call && symndx == -1 && ! ESP32S2ULPFDPIC_SYM_LOCAL (info, d.h))  */
	unsigned plt : 1;
	/* Whether a function descriptor should be created in this link unit
	for symbol+addend.  Should be implied by something like:
	(plt || fdgotoff17m4 || fdgotofflohi
	|| ((fd || fdgot17m4 || fdgothilo)
	&& (symndx != -1 || ESP32S2ULPFDPIC_FUNCDESC_LOCAL (info, d.h))))  */
	unsigned privfd : 1;
	/* Whether a lazy PLT entry is needed for this symbol+addend.
	Should be implied by something like:
	(privfd && symndx == -1 && ! ESP32S2ULPFDPIC_SYM_LOCAL (info, d.h)
	&& ! (info->flags & DF_BIND_NOW))  */
	unsigned lazyplt : 1;
	/* Whether we've already emitted GOT relocations and PLT entries as
	needed for this symbol.  */
	unsigned done : 1;

	/* The number of R_ESP32S2ULP_BYTE4_DATA, R_ESP32S2ULP_FUNCDESC and R_ESP32S2ULP_FUNCDESC_VALUE
	relocations referencing the symbol.  */
	unsigned relocs32, relocsfd, relocsfdv;

