espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	/* The number of .rofixups entries and dynamic relocations allocated
	for this symbol, minus any that might have already been used.  */
	unsigned fixups, dynrelocs;

	/* The offsets of the GOT entries assigned to symbol+addend, to the
	function descriptor's address, and to a function descriptor,
	respectively.  Should be zero if unassigned.  The offsets are
	counted from the value that will be assigned to the PIC register,
	not from the beginning of the .got section.  */
	bfd_signed_vma got_entry, fdgot_entry, fd_entry;
	/* The offsets of the PLT entries assigned to symbol+addend,
	non-lazy and lazy, respectively.  If unassigned, should be
	(bfd_vma)-1.  */
	bfd_vma plt_entry, lzplt_entry;
};

/* Compute a hash with the key fields of an esp32s2ulpfdpic_relocs_info entry.  */
static hashval_t
esp32s2ulpfdpic_relocs_info_hash(const void *entry_)
{
	const struct esp32s2ulpfdpic_relocs_info *entry = entry_;

	return (entry->symndx == -1
		? (long)entry->d.h->root.root.hash
		: entry->symndx + (long)entry->d.abfd->id * 257) + entry->addend;
}

/* Test whether the key fields of two esp32s2ulpfdpic_relocs_info entries are
identical.  */
static int
esp32s2ulpfdpic_relocs_info_eq(const void *entry1, const void *entry2)
{
	const struct esp32s2ulpfdpic_relocs_info *e1 = entry1;
	const struct esp32s2ulpfdpic_relocs_info *e2 = entry2;

	return e1->symndx == e2->symndx && e1->addend == e2->addend
		&& (e1->symndx == -1 ? e1->d.h == e2->d.h : e1->d.abfd == e2->d.abfd);
}

/* Find or create an entry in a hash table HT that matches the key
fields of the given ENTRY.  If it's not found, memory for a new
entry is allocated in ABFD's obstack.  */
static struct esp32s2ulpfdpic_relocs_info *
esp32s2ulpfdpic_relocs_info_find(struct htab *ht,
bfd *abfd,
const struct esp32s2ulpfdpic_relocs_info *entry,
enum insert_option insert)
{
	struct esp32s2ulpfdpic_relocs_info **loc;

	if (!ht)
		return NULL;

	loc = (struct esp32s2ulpfdpic_relocs_info **) htab_find_slot(ht, entry, insert);

	if (!loc)
		return NULL;

	if (*loc)
		return *loc;

	*loc = bfd_zalloc(abfd, sizeof(**loc));

	if (!*loc)
		return *loc;

	(*loc)->symndx = entry->symndx;
	(*loc)->d = entry->d;
	(*loc)->addend = entry->addend;
	(*loc)->plt_entry = (bfd_vma)-1;
	(*loc)->lzplt_entry = (bfd_vma)-1;

	return *loc;
}

/* Obtain the address of the entry in HT associated with H's symbol +
addend, creating a new entry if none existed.  ABFD is only used
for memory allocation purposes.  */
inline static struct esp32s2ulpfdpic_relocs_info *
esp32s2ulpfdpic_relocs_info_for_global(struct htab *ht,
bfd *abfd,
struct elf_link_hash_entry *h,
	bfd_vma addend,
enum insert_option insert)
{
	struct esp32s2ulpfdpic_relocs_info entry;

	entry.symndx = -1;
	entry.d.h = h;
	entry.addend = addend;

	return esp32s2ulpfdpic_relocs_info_find(ht, abfd, &entry, insert);
}

/* Obtain the address of the entry in HT associated with the SYMNDXth
local symbol of the input bfd ABFD, plus the addend, creating a new
entry if none existed.  */
inline static struct esp32s2ulpfdpic_relocs_info *
esp32s2ulpfdpic_relocs_info_for_local(struct htab *ht,
bfd *abfd,
long symndx,
bfd_vma addend,
enum insert_option insert)
{
	struct esp32s2ulpfdpic_relocs_info entry;

	entry.symndx = symndx;
	entry.d.abfd = abfd;
	entry.addend = addend;

	return esp32s2ulpfdpic_relocs_info_find(ht, abfd, &entry, insert);
}

/* Merge fields set by check_relocs() of two entries that end up being
mapped to the same (presumably global) symbol.  */

inline static void
esp32s2ulpfdpic_pic_merge_early_relocs_info(struct esp32s2ulpfdpic_relocs_info *e2,
struct esp32s2ulpfdpic_relocs_info const *e1)
{
	e2->got17m4 |= e1->got17m4;
	e2->gothilo |= e1->gothilo;
	e2->fd |= e1->fd;
	e2->fdgot17m4 |= e1->fdgot17m4;
	e2->fdgothilo |= e1->fdgothilo;
	e2->fdgoff17m4 |= e1->fdgoff17m4;
	e2->fdgoffhilo |= e1->fdgoffhilo;
	e2->gotoff |= e1->gotoff;
	e2->call |= e1->call;
	e2->sym |= e1->sym;
}

/* Every block of 65535 lazy PLT entries shares a single call to the
resolver, inserted in the 32768th lazy PLT entry (i.e., entry #
32767, counting from 0).  All other lazy PLT entries branch to it
in a single instruction.  */

#define LZPLT_RESOLVER_EXTRA 10
#define LZPLT_NORMAL_SIZE 6
#define LZPLT_ENTRIES 1362

#define ESP32S2ULPFDPIC_LZPLT_BLOCK_SIZE ((bfd_vma) LZPLT_NORMAL_SIZE * LZPLT_ENTRIES + LZPLT_RESOLVER_EXTRA)
#define ESP32S2ULPFDPIC_LZPLT_RESOLV_LOC (LZPLT_NORMAL_SIZE * LZPLT_ENTRIES / 2)


/* Add a fixup to the ROFIXUP section.  */

static bfd_vma
_esp32s2ulpfdpic_add_rofixup(bfd *output_bfd, asection *rofixup, bfd_vma offset,
struct esp32s2ulpfdpic_relocs_info *entry)
{
	bfd_vma fixup_offset;

	if (rofixup->flags & SEC_EXCLUDE)
		return -1;

	fixup_offset = rofixup->reloc_count * 4;
	if (rofixup->contents)
	{
		BFD_ASSERT(fixup_offset < rofixup->size);
		bfd_put_32(output_bfd, offset, rofixup->contents + fixup_offset);
	}
	rofixup->reloc_count++;

	if (entry && entry->symndx)
	{
		/* If the entry's index is zero, this relocation was probably to a
		linkonce section that got discarded.  We reserved a dynamic
		relocation, but it was for another entry than the one we got at
		the time of emitting the relocation.  Unfortunately there's no
		simple way for us to catch this situation, since the relocation
		is cleared right before calling relocate_section, at which point
		we no longer know what the relocation used to point to.  */
		BFD_ASSERT(entry->fixups > 0);
		entry->fixups--;
	}

	return fixup_offset;
}

/* Find the segment number in which OSEC, and output section, is
located.  */

static unsigned
_esp32s2ulpfdpic_osec_to_segment(bfd *output_bfd, asection *osec)
{
	Elf_Internal_Phdr *p = _bfd_elf_find_segment_containing_section(output_bfd, osec);

	return (p != NULL) ? p - elf_tdata(output_bfd)->phdr : -1;
}

/* Relocate an Blackfin ELF section.

The RELOCATE_SECTION function is called by the new ELF backend linker
to handle the relocations for a section.

The relocs are always passed as Rela structures; if the section
actually uses Rel structures, the r_addend field will always be
zero.

This function is responsible for adjusting the section contents as
necessary, and (if using Rela relocs and generating a relocatable
output file) adjusting the reloc addend as necessary.

