espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
This function does not have to worry about setting the reloc
address or the reloc symbol index.

LOCAL_SYMS is a pointer to the swapped in local symbols.

LOCAL_SECTIONS is an array giving the section in the input file
corresponding to the st_shndx field of each local symbol.

The global hash table entry for the global symbols can be found
via elf_sym_hashes (input_bfd).

When generating relocatable output, this function must handle
STB_LOCAL/STT_SECTION symbols specially.  The output symbol is
going to be the section symbol corresponding to the output
section, which means that the addend must be adjusted
accordingly.  */

static bfd_boolean
esp32s2ulpfdpic_relocate_section(bfd * output_bfd,
struct bfd_link_info *info,
	bfd * input_bfd,
	asection * input_section,
	bfd_byte * contents,
	Elf_Internal_Rela * relocs,
	Elf_Internal_Sym * local_syms,
	asection ** local_sections)
{
	(void)local_sections; // dya - remove warning
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	Elf_Internal_Rela *rel;
	Elf_Internal_Rela *relend;
	unsigned isec_segment,
		check_segment[2];
	int silence_segment_error = !bfd_link_pic(info);

	symtab_hdr = &elf_tdata(input_bfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(input_bfd);
	relend = relocs + input_section->reloc_count;

	isec_segment = _esp32s2ulpfdpic_osec_to_segment(output_bfd,
		input_section->output_section);

	for (rel = relocs; rel < relend; rel++)
	{
		reloc_howto_type *howto;
		unsigned long r_symndx;
		Elf_Internal_Sym *sym;
		asection *sec;
		struct elf_link_hash_entry *h;
		bfd_vma relocation;
		bfd_reloc_status_type r;
		const char * name = NULL;
		int r_type;
		struct esp32s2ulpfdpic_relocs_info *picrel;

		r_type = ELF32_R_TYPE(rel->r_info);

		if (r_type == R_ESP32S2ULP_GNU_VTINHERIT
			|| r_type == R_ESP32S2ULP_GNU_VTENTRY)
			continue;

		r_symndx = ELF32_R_SYM(rel->r_info);
		howto = esp32s2ulp_reloc_type_lookup(input_bfd, r_type);
		if (howto == NULL)
		{
			bfd_set_error(bfd_error_bad_value);
			return FALSE;
		}

		h = NULL;
		sym = NULL;
		sec = NULL;
		unsigned int section_flags = 0;
		if (r_symndx < symtab_hdr->sh_info)
		{
			sym = local_syms + r_symndx;
			relocation = _bfd_elf_rela_local_sym(output_bfd, sym, &sec, rel);
			section_flags = 0;
			name = bfd_elf_string_from_elf_section
				(input_bfd, symtab_hdr->sh_link, sym->st_name);
			name = (name == NULL) ? bfd_section_name(input_bfd, sec) : name;
		}
		else
		{
			bfd_boolean warned, ignored;
			bfd_boolean unresolved_reloc;

			ESP32S2ULP_RELOC_FOR_GLOBAL_SYMBOL(info, input_bfd, input_section, rel,
				r_symndx, symtab_hdr, sym_hashes,
				h, sec, relocation,
				unresolved_reloc, warned, ignored, section_flags);
		}

		if (sec != NULL && discarded_section(sec))
			RELOC_AGAINST_DISCARDED_SECTION(info, input_bfd, input_section,
			rel, 1, relend, howto, 0, contents);

		if (bfd_link_relocatable(info))
			continue;

		if (h != NULL
			&& (h->root.type == bfd_link_hash_defined
			|| h->root.type == bfd_link_hash_defweak)
			&& !ESP32S2ULPFDPIC_SYM_LOCAL(info, h))
		{
			relocation = 0;
		}
		(void)section_flags;
		switch (r_type)
		{

		default:
			picrel = NULL;
			if (h && !ESP32S2ULPFDPIC_SYM_LOCAL(info, h)
				&& _bfd_elf_section_offset(output_bfd, info, input_section,
				rel->r_offset) != (bfd_vma)-1)
			{
				info->callbacks->warning
					(info, _("relocation references symbol not defined in the module"),
					name, input_bfd, input_section, rel->r_offset);
				return FALSE;
			}
			break;
		}

		switch (r_type)
		{
		default:
			check_segment[0] = isec_segment;
			check_segment[1] = sec
				? _esp32s2ulpfdpic_osec_to_segment(output_bfd, sec->output_section)
				: (unsigned)-1;
			break;
		}

		if (check_segment[0] != check_segment[1] && IS_FDPIC(output_bfd))
		{
#if 1 /* If you take this out, remove the #error from fdpic-static-6.d
		in the ld testsuite.  */
			/* This helps catch problems in GCC while we can't do more
			than static linking.  The idea is to test whether the
			input file basename is crt0.o only once.  */
			if (silence_segment_error == 1)
				silence_segment_error =
				(strlen(input_bfd->filename) == 6
				&& filename_cmp(input_bfd->filename, "crt0.o") == 0)
				|| (strlen(input_bfd->filename) > 6
				&& filename_cmp(input_bfd->filename
				+ strlen(input_bfd->filename) - 7,
				"/crt0.o") == 0)
				? -1 : 0;
#endif
			if (!silence_segment_error
				/* We don't want duplicate errors for undefined
				symbols.  */
				&& !(picrel && picrel->symndx == -1
				&& picrel->d.h->root.type == bfd_link_hash_undefined))
				info->callbacks->warning
				(info,
				bfd_link_pic(info)
				? _("relocations between different segments are not supported")
				: _("warning: relocation references a different segment"),
				name, input_bfd, input_section, rel->r_offset);
			if (!silence_segment_error && bfd_link_pic(info))
				return FALSE;
			elf_elfheader(output_bfd)->e_flags |= EF_ESP32S2ULP_PIC;
		}

		r = esp32s2ulp_final_link_relocate(rel, howto, input_bfd, input_section,
			contents, rel->r_offset,
			relocation, rel->r_addend);

		if (r != bfd_reloc_ok)
		{
			const char * msg = (const char *)NULL;

			switch (r)
			{
			case bfd_reloc_overflow:
				(*info->callbacks->reloc_overflow)
					(info, (h ? &h->root : NULL), name, howto->name,
					(bfd_vma)0, input_bfd, input_section, rel->r_offset);
				break;

			case bfd_reloc_undefined:
				(*info->callbacks->undefined_symbol)
					(info, name, input_bfd, input_section, rel->r_offset, TRUE);
				break;

			case bfd_reloc_outofrange:
				msg = _("internal error: out of range error");
				break;

			case bfd_reloc_notsupported:
				msg = _("internal error: unsupported relocation error");
				break;

			case bfd_reloc_dangerous:
				msg = _("internal error: dangerous relocation");
				break;

			default:
				msg = _("internal error: unknown error");
				break;
			}

			if (msg)
				(*info->callbacks->warning) (info, msg, name, input_bfd,
				input_section, rel->r_offset);
		}
	}

	return TRUE;
}

/* Update the relocation information for the relocations of the section
being removed.  */

static bfd_boolean
esp32s2ulpfdpic_gc_sweep_hook(bfd *abfd,
struct bfd_link_info *info,
	asection *sec,
	const Elf_Internal_Rela *relocs)
{
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes, **sym_hashes_end;
	const Elf_Internal_Rela *rel;
	const Elf_Internal_Rela *rel_end;
	struct esp32s2ulpfdpic_relocs_info *picrel;

	BFD_ASSERT(IS_FDPIC(abfd));

