espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	/* If we're left with an unpaired GOT entry, compute its location
	such that we can return it.  Otherwise, if got doesn't require an
	odd number of words here, either odd was already zero in the
	block above, or it was set to zero because got was non-zero, or
	got was already zero.  In the latter case, we want the value of
	odd to carry over to the return statement, so we don't want to
	reset odd unless the condition below is true.  */
	if (got & 4)
	{
		odd = cur + got;
		got += 4;
	}

	/* Compute the tentative boundaries of this range.  */
	gad->max = cur + got;
	gad->min = fdcur - fd;
	gad->fdplt = 0;

	/* If function descriptors took too much space, wrap some of them
	around.  */
	if (gad->min < wrapmin)
	{
		gad->max += wrapmin - gad->min;
		gad->min = wrapmin;
	}
	/* If there is space left and we have function descriptors
	referenced in PLT entries that could take advantage of shorter
	offsets, place them here.  */
	else if (fdplt && gad->min > wrapmin)
	{
		bfd_vma fds;
		if ((bfd_vma)(gad->min - wrapmin) < fdplt)
			fds = gad->min - wrapmin;
		else
			fds = fdplt;

		fdplt -= fds;
		gad->min -= fds;
		gad->fdplt += fds;
	}

	/* If GOT entries took too much space, wrap some of them around.
	This may well cause gad->min to become lower than wrapmin.  This
	will cause a relocation overflow later on, so we don't have to
	report it here . */
	if ((bfd_vma)gad->max > wrap)
	{
		gad->min -= gad->max - wrap;
		gad->max = wrap;
	}
	/* If there is more space left, try to place some more function
	descriptors for PLT entries.  */
	else if (fdplt && (bfd_vma)gad->max < wrap)
	{
		bfd_vma fds;
		if ((bfd_vma)(wrap - gad->max) < fdplt)
			fds = wrap - gad->max;
		else
			fds = fdplt;

		fdplt -= fds;
		gad->max += fds;
		gad->fdplt += fds;
	}

	/* If odd was initially computed as an offset past the wrap point,
	wrap it around.  */
	if (odd > gad->max)
		odd = gad->min + odd - gad->max;

	/* _esp32s2ulpfdpic_get_got_entry() below will always wrap gad->cur if needed
	before returning, so do it here too.  This guarantees that,
	should cur and fdcur meet at the wrap point, they'll both be
	equal to min.  */
	if (gad->cur == gad->max)
		gad->cur = gad->min;

	return odd;
}

/* Compute the location of the next GOT entry, given the allocation
data for a range.  */

inline static bfd_signed_vma
_esp32s2ulpfdpic_get_got_entry(struct _esp32s2ulpfdpic_dynamic_got_alloc_data *gad)
{
	bfd_signed_vma ret;

	if (gad->odd)
	{
		/* If there was an odd word left behind, use it.  */
		ret = gad->odd;
		gad->odd = 0;
	}
	else
	{
		/* Otherwise, use the word pointed to by cur, reserve the next
		as an odd word, and skip to the next pair of words, possibly
		wrapping around.  */
		ret = gad->cur;
		gad->odd = gad->cur + 4;
		gad->cur += 8;
		if (gad->cur == gad->max)
			gad->cur = gad->min;
	}

	return ret;
}

/* Compute the location of the next function descriptor entry in the
GOT, given the allocation data for a range.  */

inline static bfd_signed_vma
_esp32s2ulpfdpic_get_fd_entry(struct _esp32s2ulpfdpic_dynamic_got_alloc_data *gad)
{
	/* If we're at the bottom, wrap around, and only then allocate the
	next pair of words.  */
	if (gad->fdcur == gad->min)
		gad->fdcur = gad->max;
	return gad->fdcur -= 8;
}

/* Assign GOT offsets for every GOT entry and function descriptor.
Doing everything in a single pass is tricky.  */

static int
_esp32s2ulpfdpic_assign_got_entries(void **entryp, void *info_)
{
	struct esp32s2ulpfdpic_relocs_info *entry = *entryp;
	struct _esp32s2ulpfdpic_dynamic_got_plt_info *dinfo = info_;

	if (entry->got17m4)
		entry->got_entry = _esp32s2ulpfdpic_get_got_entry(&dinfo->got17m4);
	else if (entry->gothilo)
		entry->got_entry = _esp32s2ulpfdpic_get_got_entry(&dinfo->gothilo);

	if (entry->fdgot17m4)
		entry->fdgot_entry = _esp32s2ulpfdpic_get_got_entry(&dinfo->got17m4);
	else if (entry->fdgothilo)
		entry->fdgot_entry = _esp32s2ulpfdpic_get_got_entry(&dinfo->gothilo);

	if (entry->fdgoff17m4)
		entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->got17m4);
	else if (entry->plt && dinfo->got17m4.fdplt)
	{
		dinfo->got17m4.fdplt -= 8;
		entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->got17m4);
	}
	else if (entry->plt)
	{
		dinfo->gothilo.fdplt -= 8;
		entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->gothilo);
	}
	else if (entry->privfd)
		entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->gothilo);

	return 1;
}

/* Assign GOT offsets to private function descriptors used by PLT
entries (or referenced by 32-bit offsets), as well as PLT entries
and lazy PLT entries.  */

static int
_esp32s2ulpfdpic_assign_plt_entries(void **entryp, void *info_)
{
	struct esp32s2ulpfdpic_relocs_info *entry = *entryp;
	struct _esp32s2ulpfdpic_dynamic_got_plt_info *dinfo = info_;

	/* If this symbol requires a local function descriptor, allocate
	one.  */
	if (entry->privfd && entry->fd_entry == 0)
	{
		if (dinfo->got17m4.fdplt)
		{
			entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->got17m4);
			dinfo->got17m4.fdplt -= 8;
		}
		else
		{
			BFD_ASSERT(dinfo->gothilo.fdplt);
			entry->fd_entry = _esp32s2ulpfdpic_get_fd_entry(&dinfo->gothilo);
			dinfo->gothilo.fdplt -= 8;
		}
	}

	if (entry->plt)
	{
		int size;

		/* We use the section's raw size to mark the location of the
		next PLT entry.  */
		entry->plt_entry = esp32s2ulpfdpic_plt_section(dinfo->g.info)->size;

		/* Figure out the length of this PLT entry based on the
		addressing mode we need to reach the function descriptor.  */
		BFD_ASSERT(entry->fd_entry);
		if (entry->fd_entry >= -(1 << (18 - 1))
			&& entry->fd_entry + 4 < (1 << (18 - 1)))
			size = 10;
		else
			size = 16;

		esp32s2ulpfdpic_plt_section(dinfo->g.info)->size += size;
	}

	if (entry->lazyplt)
	{
		entry->lzplt_entry = dinfo->g.lzplt;
		dinfo->g.lzplt += LZPLT_NORMAL_SIZE;
		/* If this entry is the one that gets the resolver stub, account
		for the additional instruction.  */
		if (entry->lzplt_entry % ESP32S2ULPFDPIC_LZPLT_BLOCK_SIZE
			== ESP32S2ULPFDPIC_LZPLT_RESOLV_LOC)
			dinfo->g.lzplt += LZPLT_RESOLVER_EXTRA;
	}

	return 1;
}

/* Cancel out any effects of calling _esp32s2ulpfdpic_assign_got_entries and
_esp32s2ulpfdpic_assign_plt_entries.  */

static int
_esp32s2ulpfdpic_reset_got_plt_entries(void **entryp, void *ignore ATTRIBUTE_UNUSED)
{
	struct esp32s2ulpfdpic_relocs_info *entry = *entryp;

	entry->got_entry = 0;
	entry->fdgot_entry = 0;
	entry->fd_entry = 0;
	entry->plt_entry = (bfd_vma)-1;
	entry->lzplt_entry = (bfd_vma)-1;

	return 1;
}

/* Follow indirect and warning hash entries so that each got entry
points to the final symbol definition.  P must point to a pointer
to the hash table we're traversing.  Since this traversal may
modify the hash table, we set this pointer to NULL to indicate
we've made a potentially-destructive change to the hash table, so
the traversal must be restarted.  */
static int
_esp32s2ulpfdpic_resolve_final_relocs_info(void **entryp, void *p)
{
	struct esp32s2ulpfdpic_relocs_info *entry = *entryp;
	htab_t *htab = p;

	if (entry->symndx == -1)
	{
		struct elf_link_hash_entry *h = entry->d.h;
		struct esp32s2ulpfdpic_relocs_info *oentry;

		while (h->root.type == bfd_link_hash_indirect
			|| h->root.type == bfd_link_hash_warning)
			h = (struct elf_link_hash_entry *)h->root.u.i.link;

		if (entry->d.h == h)
			return 1;

