espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
		oentry = esp32s2ulpfdpic_relocs_info_for_global(*htab, 0, h, entry->addend,
			NO_INSERT);

		if (oentry)
		{
			/* Merge the two entries.  */
			esp32s2ulpfdpic_pic_merge_early_relocs_info(oentry, entry);
			htab_clear_slot(*htab, entryp);
			return 1;
		}

		entry->d.h = h;

		/* If we can't find this entry with the new bfd hash, re-insert
		it, and get the traversal restarted.  */
		if (!htab_find(*htab, entry))
		{
			htab_clear_slot(*htab, entryp);
			entryp = htab_find_slot(*htab, entry, INSERT);
			if (!*entryp)
				*entryp = entry;
			/* Abort the traversal, since the whole table may have
			moved, and leave it up to the parent to restart the
			process.  */
			*(htab_t *)p = NULL;
			return 0;
		}
	}

	return 1;
}

/* Compute the total size of the GOT, the PLT, the dynamic relocations
section and the rofixup section.  Assign locations for GOT and PLT
entries.  */

static bfd_boolean
_esp32s2ulpfdpic_size_got_plt(bfd *output_bfd,
struct _esp32s2ulpfdpic_dynamic_got_plt_info *gpinfop)
{
	bfd_signed_vma odd;
	bfd_vma limit;
	struct bfd_link_info *info = gpinfop->g.info;
	bfd *dynobj = elf_hash_table(info)->dynobj;

	memcpy(esp32s2ulpfdpic_dynamic_got_plt_info(info), &gpinfop->g,
		sizeof(gpinfop->g));

	odd = 12;
	/* Compute the total size taken by entries in the 18-bit range,
	to tell how many PLT function descriptors we can bring into it
	without causing it to overflow.  */
	limit = odd + gpinfop->g.got17m4 + gpinfop->g.fd17m4;
	if (limit < (bfd_vma)1 << 18)
		limit = ((bfd_vma)1 << 18) - limit;
	else
		limit = 0;
	if (gpinfop->g.fdplt < limit)
		limit = gpinfop->g.fdplt;

	/* Determine the ranges of GOT offsets that we can use for each
	range of addressing modes.  */
	odd = _esp32s2ulpfdpic_compute_got_alloc_data(&gpinfop->got17m4,
		0,
		odd,
		16,
		gpinfop->g.got17m4,
		gpinfop->g.fd17m4,
		limit,
		(bfd_vma)1 << (18 - 1));
	odd = _esp32s2ulpfdpic_compute_got_alloc_data(&gpinfop->gothilo,
		gpinfop->got17m4.min,
		odd,
		gpinfop->got17m4.max,
		gpinfop->g.gothilo,
		gpinfop->g.fdhilo,
		gpinfop->g.fdplt - gpinfop->got17m4.fdplt,
		(bfd_vma)1 << (32 - 1));

	/* Now assign (most) GOT offsets.  */
	htab_traverse(esp32s2ulpfdpic_relocs_info(info), _esp32s2ulpfdpic_assign_got_entries,
		gpinfop);

	esp32s2ulpfdpic_got_section(info)->size = gpinfop->gothilo.max
		- gpinfop->gothilo.min
		/* If an odd word is the last word of the GOT, we don't need this
		word to be part of the GOT.  */
		- (odd + 4 == gpinfop->gothilo.max ? 4 : 0);
	if (esp32s2ulpfdpic_got_section(info)->size == 0)
		esp32s2ulpfdpic_got_section(info)->flags |= SEC_EXCLUDE;
	else if (esp32s2ulpfdpic_got_section(info)->size == 12
		&& !elf_hash_table(info)->dynamic_sections_created)
	{
		esp32s2ulpfdpic_got_section(info)->flags |= SEC_EXCLUDE;
		esp32s2ulpfdpic_got_section(info)->size = 0;
	}
	else
	{
		esp32s2ulpfdpic_got_section(info)->contents =
			(bfd_byte *)bfd_zalloc(dynobj,
			esp32s2ulpfdpic_got_section(info)->size);
		if (esp32s2ulpfdpic_got_section(info)->contents == NULL)
			return FALSE;
	}

	if (elf_hash_table(info)->dynamic_sections_created)
		/* Subtract the number of lzplt entries, since those will generate
		relocations in the pltrel section.  */
		esp32s2ulpfdpic_gotrel_section(info)->size =
		(gpinfop->g.relocs - gpinfop->g.lzplt / LZPLT_NORMAL_SIZE)
		* get_elf_backend_data(output_bfd)->s->sizeof_rel;
	else
		BFD_ASSERT(gpinfop->g.relocs == 0);
	if (esp32s2ulpfdpic_gotrel_section(info)->size == 0)
		esp32s2ulpfdpic_gotrel_section(info)->flags |= SEC_EXCLUDE;
	else
	{
		esp32s2ulpfdpic_gotrel_section(info)->contents =
			(bfd_byte *)bfd_zalloc(dynobj,
			esp32s2ulpfdpic_gotrel_section(info)->size);
		if (esp32s2ulpfdpic_gotrel_section(info)->contents == NULL)
			return FALSE;
	}

	esp32s2ulpfdpic_gotfixup_section(info)->size = (gpinfop->g.fixups + 1) * 4;
	if (esp32s2ulpfdpic_gotfixup_section(info)->size == 0)
		esp32s2ulpfdpic_gotfixup_section(info)->flags |= SEC_EXCLUDE;
	else
	{
		esp32s2ulpfdpic_gotfixup_section(info)->contents =
			(bfd_byte *)bfd_zalloc(dynobj,
			esp32s2ulpfdpic_gotfixup_section(info)->size);
		if (esp32s2ulpfdpic_gotfixup_section(info)->contents == NULL)
			return FALSE;
	}

	if (elf_hash_table(info)->dynamic_sections_created)
		esp32s2ulpfdpic_pltrel_section(info)->size =
		gpinfop->g.lzplt / LZPLT_NORMAL_SIZE * get_elf_backend_data(output_bfd)->s->sizeof_rel;
	if (esp32s2ulpfdpic_pltrel_section(info)->size == 0)
		esp32s2ulpfdpic_pltrel_section(info)->flags |= SEC_EXCLUDE;
	else
	{
		esp32s2ulpfdpic_pltrel_section(info)->contents =
			(bfd_byte *)bfd_zalloc(dynobj,
			esp32s2ulpfdpic_pltrel_section(info)->size);
		if (esp32s2ulpfdpic_pltrel_section(info)->contents == NULL)
			return FALSE;
	}

	/* Add 4 bytes for every block of at most 65535 lazy PLT entries,
	such that there's room for the additional instruction needed to
	call the resolver.  Since _esp32s2ulpfdpic_assign_got_entries didn't
	account for them, our block size is 4 bytes smaller than the real
	block size.  */
	if (elf_hash_table(info)->dynamic_sections_created)
	{
		esp32s2ulpfdpic_plt_section(info)->size = gpinfop->g.lzplt
			+ ((gpinfop->g.lzplt + (ESP32S2ULPFDPIC_LZPLT_BLOCK_SIZE - 4) - LZPLT_NORMAL_SIZE)
			/ (ESP32S2ULPFDPIC_LZPLT_BLOCK_SIZE - 4) * LZPLT_RESOLVER_EXTRA);
	}

	/* Reset it, such that _esp32s2ulpfdpic_assign_plt_entries() can use it to
	actually assign lazy PLT entries addresses.  */
	gpinfop->g.lzplt = 0;

	/* Save information that we're going to need to generate GOT and PLT
	entries.  */
	esp32s2ulpfdpic_got_initial_offset(info) = -gpinfop->gothilo.min;

	if (get_elf_backend_data(output_bfd)->want_got_sym)
		elf_hash_table(info)->hgot->root.u.def.value
		= esp32s2ulpfdpic_got_initial_offset(info);

	if (elf_hash_table(info)->dynamic_sections_created)
		esp32s2ulpfdpic_plt_initial_offset(info) =
		esp32s2ulpfdpic_plt_section(info)->size;

	htab_traverse(esp32s2ulpfdpic_relocs_info(info), _esp32s2ulpfdpic_assign_plt_entries,
		gpinfop);

	/* Allocate the PLT section contents only after
	_esp32s2ulpfdpic_assign_plt_entries has a chance to add the size of the
	non-lazy PLT entries.  */
	if (esp32s2ulpfdpic_plt_section(info)->size == 0)
		esp32s2ulpfdpic_plt_section(info)->flags |= SEC_EXCLUDE;
	else
	{
		esp32s2ulpfdpic_plt_section(info)->contents =
			(bfd_byte *)bfd_zalloc(dynobj,
			esp32s2ulpfdpic_plt_section(info)->size);
		if (esp32s2ulpfdpic_plt_section(info)->contents == NULL)
			return FALSE;
	}

