espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	return TRUE;
}

/* Set the sizes of the dynamic sections.  */

static bfd_boolean
elf32_esp32s2ulpfdpic_size_dynamic_sections(bfd *output_bfd,
struct bfd_link_info *info)
{
	struct elf_link_hash_table *htab;
	bfd *dynobj;
	asection *s;
	struct _esp32s2ulpfdpic_dynamic_got_plt_info gpinfo;

	htab = elf_hash_table(info);
	dynobj = htab->dynobj;
	BFD_ASSERT(dynobj != NULL);

	if (htab->dynamic_sections_created)
	{
		/* Set the contents of the .interp section to the interpreter.  */
		if (bfd_link_executable(info) && !info->nointerp)
		{
			s = bfd_get_linker_section(dynobj, ".interp");
			BFD_ASSERT(s != NULL);
			s->size = sizeof ELF_DYNAMIC_INTERPRETER;
			s->contents = (bfd_byte *)ELF_DYNAMIC_INTERPRETER;
		}
	}

	memset(&gpinfo, 0, sizeof(gpinfo));
	gpinfo.g.info = info;

	for (;;)
	{
		htab_t relocs = esp32s2ulpfdpic_relocs_info(info);

		htab_traverse(relocs, _esp32s2ulpfdpic_resolve_final_relocs_info, &relocs);

		if (relocs == esp32s2ulpfdpic_relocs_info(info))
			break;
	}

	htab_traverse(esp32s2ulpfdpic_relocs_info(info), _esp32s2ulpfdpic_count_got_plt_entries,
		&gpinfo.g);

	/* Allocate space to save the summary information, we're going to
	use it if we're doing relaxations.  */
	esp32s2ulpfdpic_dynamic_got_plt_info(info) = bfd_alloc(dynobj, sizeof(gpinfo.g));

	if (!_esp32s2ulpfdpic_size_got_plt(output_bfd, &gpinfo))
		return FALSE;

	if (elf_hash_table(info)->dynamic_sections_created)
	{
		if (esp32s2ulpfdpic_got_section(info)->size)
			if (!_bfd_elf_add_dynamic_entry(info, DT_PLTGOT, 0))
				return FALSE;

		if (esp32s2ulpfdpic_pltrel_section(info)->size)
			if (!_bfd_elf_add_dynamic_entry(info, DT_PLTRELSZ, 0)
				|| !_bfd_elf_add_dynamic_entry(info, DT_PLTREL, DT_REL)
				|| !_bfd_elf_add_dynamic_entry(info, DT_JMPREL, 0))
				return FALSE;

		if (esp32s2ulpfdpic_gotrel_section(info)->size)
			if (!_bfd_elf_add_dynamic_entry(info, DT_REL, 0)
				|| !_bfd_elf_add_dynamic_entry(info, DT_RELSZ, 0)
				|| !_bfd_elf_add_dynamic_entry(info, DT_RELENT,
				sizeof(Elf32_External_Rel)))
				return FALSE;
	}

	s = bfd_get_linker_section(dynobj, ".dynbss");
	if (s && s->size == 0)
		s->flags |= SEC_EXCLUDE;

	s = bfd_get_linker_section(dynobj, ".rela.bss");
	if (s && s->size == 0)
		s->flags |= SEC_EXCLUDE;

	return TRUE;
}

static bfd_boolean
elf32_esp32s2ulpfdpic_always_size_sections(bfd *output_bfd,
struct bfd_link_info *info)
{
	if (!bfd_link_relocatable(info)
		&& !bfd_elf_stack_segment_size(output_bfd, info,
		"__stacksize", DEFAULT_STACK_SIZE))
		return FALSE;

	return TRUE;
}

/* Check whether any of the relocations was optimized away, and
subtract it from the relocation or fixup count.  */
static bfd_boolean
_esp32s2ulpfdpic_check_discarded_relocs(bfd *abfd, asection *sec,
struct bfd_link_info *info,
	bfd_boolean *changed)
{
	(void)info;// dya - remove warning
	(void)changed;// dya - remove warning
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes, **sym_hashes_end;

	if ((sec->flags & SEC_RELOC) == 0
		|| sec->reloc_count == 0)
		return TRUE;

	symtab_hdr = &elf_tdata(abfd)->symtab_hdr;
	sym_hashes = elf_sym_hashes(abfd);
	sym_hashes_end = sym_hashes + symtab_hdr->sh_size / sizeof(Elf32_External_Sym);
	if (!elf_bad_symtab(abfd))
		sym_hashes_end -= symtab_hdr->sh_info;

	return TRUE;
}

static bfd_boolean
esp32s2ulpfdpic_elf_discard_info(bfd *ibfd,
struct elf_reloc_cookie *cookie ATTRIBUTE_UNUSED,
struct bfd_link_info *info)
{
	bfd_boolean changed = FALSE;
	asection *s;
	bfd *obfd = NULL;

	/* Account for relaxation of .eh_frame section.  */
	for (s = ibfd->sections; s; s = s->next)
		if (s->sec_info_type == SEC_INFO_TYPE_EH_FRAME)
		{
			if (!_esp32s2ulpfdpic_check_discarded_relocs(ibfd, s, info, &changed))
				return FALSE;
			obfd = s->output_section->owner;
		}

	if (changed)
	{
		struct _esp32s2ulpfdpic_dynamic_got_plt_info gpinfo;

		memset(&gpinfo, 0, sizeof(gpinfo));
		memcpy(&gpinfo.g, esp32s2ulpfdpic_dynamic_got_plt_info(info),
			sizeof(gpinfo.g));

		/* Clear GOT and PLT assignments.  */
		htab_traverse(esp32s2ulpfdpic_relocs_info(info),
			_esp32s2ulpfdpic_reset_got_plt_entries,
			NULL);

		if (!_esp32s2ulpfdpic_size_got_plt(obfd, &gpinfo))
			return FALSE;
	}

	return TRUE;
}

static bfd_boolean
elf32_esp32s2ulpfdpic_finish_dynamic_sections(bfd *output_bfd,
struct bfd_link_info *info)
{
	bfd *dynobj;
	asection *sdyn;

	dynobj = elf_hash_table(info)->dynobj;

	if (esp32s2ulpfdpic_got_section(info))
	{
		BFD_ASSERT(esp32s2ulpfdpic_gotrel_section(info)->size
			/* PR 17334: It appears that the GOT section can end up
			being bigger than the number of relocs.  Presumably
			because some relocs have been deleted.  A test case has
			yet to be generated for verify this, but in the meantime
			the test below has been changed from == to >= so that
			applications can continue to be built.  */
			>= (esp32s2ulpfdpic_gotrel_section(info)->reloc_count
			* sizeof(Elf32_External_Rel)));

		if (esp32s2ulpfdpic_gotfixup_section(info))
		{
			struct elf_link_hash_entry *hgot = elf_hash_table(info)->hgot;
			bfd_vma got_value = hgot->root.u.def.value
				+ hgot->root.u.def.section->output_section->vma
				+ hgot->root.u.def.section->output_offset;

			_esp32s2ulpfdpic_add_rofixup(output_bfd, esp32s2ulpfdpic_gotfixup_section(info),
				got_value, 0);

			if (esp32s2ulpfdpic_gotfixup_section(info)->size
				!= (esp32s2ulpfdpic_gotfixup_section(info)->reloc_count * 4))
			{
				_bfd_error_handler
					("LINKER BUG: .rofixup section size mismatch");
				return FALSE;
			}
		}
	}
	if (elf_hash_table(info)->dynamic_sections_created)
	{
		BFD_ASSERT(esp32s2ulpfdpic_pltrel_section(info)->size
			== (esp32s2ulpfdpic_pltrel_section(info)->reloc_count
			* sizeof(Elf32_External_Rel)));
	}

	sdyn = bfd_get_linker_section(dynobj, ".dynamic");

	if (elf_hash_table(info)->dynamic_sections_created)
	{
		Elf32_External_Dyn * dyncon;
		Elf32_External_Dyn * dynconend;

		BFD_ASSERT(sdyn != NULL);

		dyncon = (Elf32_External_Dyn *)sdyn->contents;
		dynconend = (Elf32_External_Dyn *)(sdyn->contents + sdyn->size);

		for (; dyncon < dynconend; dyncon++)
		{
			Elf_Internal_Dyn dyn;

			bfd_elf32_swap_dyn_in(dynobj, dyncon, &dyn);

