espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
			switch (dyn.d_tag)
			{
			default:
				break;

			case DT_PLTGOT:
				dyn.d_un.d_ptr = esp32s2ulpfdpic_got_section(info)->output_section->vma
					+ esp32s2ulpfdpic_got_section(info)->output_offset
					+ esp32s2ulpfdpic_got_initial_offset(info);
				bfd_elf32_swap_dyn_out(output_bfd, &dyn, dyncon);
				break;

			case DT_JMPREL:
				dyn.d_un.d_ptr = esp32s2ulpfdpic_pltrel_section(info)
					->output_section->vma
					+ esp32s2ulpfdpic_pltrel_section(info)->output_offset;
				bfd_elf32_swap_dyn_out(output_bfd, &dyn, dyncon);
				break;

			case DT_PLTRELSZ:
				dyn.d_un.d_val = esp32s2ulpfdpic_pltrel_section(info)->size;
				bfd_elf32_swap_dyn_out(output_bfd, &dyn, dyncon);
				break;
			}
		}
	}

	return TRUE;
}

/* Adjust a symbol defined by a dynamic object and referenced by a
regular object.  */

static bfd_boolean
elf32_esp32s2ulpfdpic_adjust_dynamic_symbol(struct bfd_link_info *info,
struct elf_link_hash_entry *h)
{
	bfd * dynobj;

	dynobj = elf_hash_table(info)->dynobj;

	/* Make sure we know what is going on here.  */
	BFD_ASSERT(dynobj != NULL
		&& (h->u.weakdef != NULL
		|| (h->def_dynamic
		&& h->ref_regular
		&& !h->def_regular)));

	/* If this is a weak symbol, and there is a real definition, the
	processor independent code will have arranged for us to see the
	real definition first, and we can just use the same value.  */
	if (h->u.weakdef != NULL)
	{
		BFD_ASSERT(h->u.weakdef->root.type == bfd_link_hash_defined
			|| h->u.weakdef->root.type == bfd_link_hash_defweak);
		h->root.u.def.section = h->u.weakdef->root.u.def.section;
		h->root.u.def.value = h->u.weakdef->root.u.def.value;
	}

	return TRUE;
}

/* Perform any actions needed for dynamic symbols.  */

static bfd_boolean
elf32_esp32s2ulpfdpic_finish_dynamic_symbol
(bfd *output_bfd ATTRIBUTE_UNUSED,
struct bfd_link_info *info ATTRIBUTE_UNUSED,
struct elf_link_hash_entry *h ATTRIBUTE_UNUSED,
	Elf_Internal_Sym *sym ATTRIBUTE_UNUSED)
{
	return TRUE;
}

/* Decide whether to attempt to turn absptr or lsda encodings in
shared libraries into pcrel within the given input section.  */

static bfd_boolean
esp32s2ulpfdpic_elf_use_relative_eh_frame
(bfd *input_bfd ATTRIBUTE_UNUSED,
struct bfd_link_info *info ATTRIBUTE_UNUSED,
	asection *eh_frame_section ATTRIBUTE_UNUSED)
{
	/* We can't use PC-relative encodings in FDPIC binaries, in general.  */
	return FALSE;
}

/* Adjust the contents of an eh_frame_hdr section before they're output.  */

static bfd_byte
esp32s2ulpfdpic_elf_encode_eh_address(bfd *abfd,
struct bfd_link_info *info,
	asection *osec, bfd_vma offset,
	asection *loc_sec, bfd_vma loc_offset,
	bfd_vma *encoded)
{
	struct elf_link_hash_entry *h;

	h = elf_hash_table(info)->hgot;
	BFD_ASSERT(h && h->root.type == bfd_link_hash_defined);

	if (!h || (_esp32s2ulpfdpic_osec_to_segment(abfd, osec)
		== _esp32s2ulpfdpic_osec_to_segment(abfd, loc_sec->output_section)))
		return _bfd_elf_encode_eh_address(abfd, info, osec, offset,
		loc_sec, loc_offset, encoded);

	BFD_ASSERT(_esp32s2ulpfdpic_osec_to_segment(abfd, osec)
		== (_esp32s2ulpfdpic_osec_to_segment
		(abfd, h->root.u.def.section->output_section)));

	*encoded = osec->vma + offset
		- (h->root.u.def.value
		+ h->root.u.def.section->output_section->vma
		+ h->root.u.def.section->output_offset);

	return DW_EH_PE_datarel | DW_EH_PE_sdata4;
}



/* Look through the relocs for a section during the first phase.

Besides handling virtual table relocs for gc, we have to deal with
all sorts of PIC-related relocations.  We describe below the
general plan on how to handle such relocations, even though we only
collect information at this point, storing them in hash tables for
perusal of later passes.

32 relocations are propagated to the linker output when creating
position-independent output.  LO16 and HI16 relocations are not
supposed to be encountered in this case.

LABEL16 should always be resolvable by the linker, since it's only
used by branches.

LABEL24, on the other hand, is used by calls.  If it turns out that
the target of a call is a dynamic symbol, a PLT entry must be
created for it, which triggers the creation of a private function
descriptor and, unless lazy binding is disabled, a lazy PLT entry.

GPREL relocations require the referenced symbol to be in the same
segment as _gp, but this can only be checked later.

All GOT, GOTOFF and FUNCDESC relocations require a .got section to
exist.  LABEL24 might as well, since it may require a PLT entry,
that will require a got.

Non-FUNCDESC GOT relocations require a GOT entry to be created
regardless of whether the symbol is dynamic.  However, since a
global symbol that turns out to not be exported may have the same
address of a non-dynamic symbol, we don't assign GOT entries at
this point, such that we can share them in this case.  A relocation
for the GOT entry always has to be created, be it to offset a
private symbol by the section load address, be it to get the symbol
resolved dynamically.

FUNCDESC GOT relocations require a GOT entry to be created, and
handled as if a FUNCDESC relocation was applied to the GOT entry in
an object file.

FUNCDESC relocations referencing a symbol that turns out to NOT be
dynamic cause a private function descriptor to be created.  The
FUNCDESC relocation then decays to a 32 relocation that points at
the private descriptor.  If the symbol is dynamic, the FUNCDESC
relocation is propagated to the linker output, such that the
dynamic linker creates the canonical descriptor, pointing to the
dynamically-resolved definition of the function.

Non-FUNCDESC GOTOFF relocations must always refer to non-dynamic
symbols that are assigned to the same segment as the GOT, but we
can only check this later, after we know the complete set of
symbols defined and/or exported.

FUNCDESC GOTOFF relocations require a function descriptor to be
created and, unless lazy binding is disabled or the symbol is not
dynamic, a lazy PLT entry.  Since we can't tell at this point
whether a symbol is going to be dynamic, we have to decide later
whether to create a lazy PLT entry or bind the descriptor directly
to the private function.

FUNCDESC_VALUE relocations are not supposed to be present in object
files, but they may very well be simply propagated to the linker
output, since they have no side effect.


A function descriptor always requires a FUNCDESC_VALUE relocation.
Whether it's in .plt.rel or not depends on whether lazy binding is
enabled and on whether the referenced symbol is dynamic.

The existence of a lazy PLT requires the resolverStub lazy PLT
entry to be present.


As for assignment of GOT, PLT and lazy PLT entries, and private
descriptors, we might do them all sequentially, but we can do
better than that.  For example, we can place GOT entries and
private function descriptors referenced using 12-bit operands
closer to the PIC register value, such that these relocations don't
overflow.  Those that are only referenced with LO16 relocations
could come next, but we may as well place PLT-required function
descriptors in the 12-bit range to make them shorter.  Symbols
referenced with LO16/HI16 may come next, but we may place
additional function descriptors in the 16-bit range if we can
reliably tell that we've already placed entries that are ever
referenced with only LO16.  PLT entries are therefore generated as
small as possible, while not introducing relocation overflows in
GOT or FUNCDESC_GOTOFF relocations.  Lazy PLT entries could be
generated before or after PLT entries, but not intermingled with
them, such that we can have more lazy PLT entries in range for a
branch to the resolverStub.  The resolverStub should be emitted at
the most distant location from the first lazy PLT entry such that
it's still in range for a branch, or closer, if there isn't a need
for so many lazy PLT entries.  Additional lazy PLT entries may be
emitted after the resolverStub, as long as branches are still in
range.  If the branch goes out of range, longer lazy PLT entries
are emitted.

We could further optimize PLT and lazy PLT entries by giving them
priority in assignment to closer-to-gr17 locations depending on the
number of occurrences of references to them (assuming a function
that's called more often is more important for performance, so its
PLT entry should be faster), or taking hints from the compiler.
Given infinite time and money... :-)  */

static bfd_boolean
esp32s2ulpfdpic_check_relocs(bfd *abfd, struct bfd_link_info *info,
asection *sec, const Elf_Internal_Rela *relocs)
{
	Elf_Internal_Shdr *symtab_hdr;
	struct elf_link_hash_entry **sym_hashes;
	const Elf_Internal_Rela *rel;
	const Elf_Internal_Rela *rel_end;

