espressif/binutils-esp32ulp/bfd/elf32-esp32s2ulp.c
	if (isymbuf != NULL && symtab_hdr->contents != (unsigned char *)isymbuf)
		free(isymbuf);
	if (internal_relocs != NULL
		&& elf_section_data(datasec)->relocs != internal_relocs)
		free(internal_relocs);
	return TRUE;

error_return:
	if (isymbuf != NULL && symtab_hdr->contents != (unsigned char *)isymbuf)
		free(isymbuf);
	if (internal_relocs != NULL
		&& elf_section_data(datasec)->relocs != internal_relocs)
		free(internal_relocs);
	return FALSE;
}

struct bfd_elf_special_section const elf32_esp32s2ulp_special_sections[] =
{
	{ NULL, 0, 0, 0, 0 }
};


#define TARGET_LITTLE_SYM		esp32s2ulp_elf32_vec
#define TARGET_LITTLE_NAME		"elf32-esp32s2ulp"
#define ELF_ARCH				bfd_arch_esp32s2ulp
#define ELF_TARGET_ID			ESP32S2ULP_ELF_DATA
#define ELF_MACHINE_CODE		EM_ESP32S2ULP
#define ELF_MAXPAGESIZE			0x1000
#define elf_symbol_leading_char		'_'

#define bfd_elf32_bfd_reloc_type_lookup	esp32s2ulp_bfd_reloc_type_lookup
#define bfd_elf32_bfd_reloc_name_lookup \
					esp32s2ulp_bfd_reloc_name_lookup
#define elf_info_to_howto		esp32s2ulp_info_to_howto
#define elf_info_to_howto_rel		0
#define elf_backend_object_p		elf32_esp32s2ulp_object_p

#define bfd_elf32_bfd_is_local_label_name \
                                        esp32s2ulp_is_local_label_name
#define esp32s2ulp_hash_table(p) \
  ((struct esp32s2ulp_link_hash_table *) (p)->hash)



#define elf_backend_create_dynamic_sections \
                                        _bfd_elf_create_dynamic_sections
#define bfd_elf32_bfd_link_hash_table_create \
                                        esp32s2ulp_link_hash_table_create
#define bfd_elf32_bfd_final_link        bfd_elf_gc_common_final_link

#define elf_backend_check_relocs        esp32s2ulp_check_relocs
#define elf_backend_adjust_dynamic_symbol \
                                        esp32s2ulp_adjust_dynamic_symbol
#define elf_backend_size_dynamic_sections \
                                        esp32s2ulp_size_dynamic_sections
#define elf_backend_relocate_section    esp32s2ulp_relocate_section
#define elf_backend_finish_dynamic_symbol \
                                        esp32s2ulp_finish_dynamic_symbol
#define elf_backend_finish_dynamic_sections \
                                        esp32s2ulp_finish_dynamic_sections
#define elf_backend_gc_mark_hook        esp32s2ulp_gc_mark_hook
#define elf_backend_gc_sweep_hook       esp32s2ulp_gc_sweep_hook
#define bfd_elf32_bfd_merge_private_bfd_data \
                                        elf32_esp32s2ulp_merge_private_bfd_data
#define bfd_elf32_bfd_set_private_flags \
                                        elf32_esp32s2ulp_set_private_flags
#define bfd_elf32_bfd_print_private_bfd_data \
                                        elf32_esp32s2ulp_print_private_bfd_data
#define elf_backend_final_write_processing \
                                        elf32_esp32s2ulp_final_write_processing
#define elf_backend_reloc_type_class    elf32_esp32s2ulp_reloc_type_class
#define elf_backend_stack_align		8
#define elf_backend_can_gc_sections 1
#define elf_backend_special_sections	elf32_esp32s2ulp_special_sections
#define elf_backend_can_refcount 1
#define elf_backend_want_got_plt 0
#define elf_backend_plt_readonly 1
#define elf_backend_want_plt_sym 0
#define elf_backend_got_header_size     12
#define elf_backend_rela_normal         1

#include "elf32-target.h"

#undef TARGET_LITTLE_SYM
#define TARGET_LITTLE_SYM          esp32s2ulp_elf32_fdpic_vec
#undef TARGET_LITTLE_NAME
#define TARGET_LITTLE_NAME		"elf32-esp32s2ulpfdpic"
#undef	elf32_bed
#define	elf32_bed		elf32_esp32s2ulpfdpic_bed

#undef elf_backend_gc_sweep_hook
#define elf_backend_gc_sweep_hook       esp32s2ulpfdpic_gc_sweep_hook

#undef elf_backend_got_header_size
#define elf_backend_got_header_size     0

#undef elf_backend_relocate_section
#define elf_backend_relocate_section    esp32s2ulpfdpic_relocate_section
#undef elf_backend_check_relocs
#define elf_backend_check_relocs        esp32s2ulpfdpic_check_relocs

#undef bfd_elf32_bfd_link_hash_table_create
#define bfd_elf32_bfd_link_hash_table_create \
		esp32s2ulpfdpic_elf_link_hash_table_create
#undef elf_backend_always_size_sections
#define elf_backend_always_size_sections \
		elf32_esp32s2ulpfdpic_always_size_sections

#undef elf_backend_create_dynamic_sections
#define elf_backend_create_dynamic_sections \
		elf32_esp32s2ulpfdpic_create_dynamic_sections
#undef elf_backend_adjust_dynamic_symbol
#define elf_backend_adjust_dynamic_symbol \
		elf32_esp32s2ulpfdpic_adjust_dynamic_symbol
#undef elf_backend_size_dynamic_sections
#define elf_backend_size_dynamic_sections \
		elf32_esp32s2ulpfdpic_size_dynamic_sections
#undef elf_backend_finish_dynamic_symbol
#define elf_backend_finish_dynamic_symbol \
		elf32_esp32s2ulpfdpic_finish_dynamic_symbol
#undef elf_backend_finish_dynamic_sections
#define elf_backend_finish_dynamic_sections \
		elf32_esp32s2ulpfdpic_finish_dynamic_sections

#undef elf_backend_discard_info
#define elf_backend_discard_info \
		esp32s2ulpfdpic_elf_discard_info
#undef elf_backend_can_make_relative_eh_frame
#define elf_backend_can_make_relative_eh_frame \
		esp32s2ulpfdpic_elf_use_relative_eh_frame
#undef elf_backend_can_make_lsda_relative_eh_frame
#define elf_backend_can_make_lsda_relative_eh_frame \
		esp32s2ulpfdpic_elf_use_relative_eh_frame
#undef elf_backend_encode_eh_address
#define elf_backend_encode_eh_address \
		esp32s2ulpfdpic_elf_encode_eh_address

#undef elf_backend_may_use_rel_p
#define elf_backend_may_use_rel_p       1
#undef elf_backend_may_use_rela_p
#define elf_backend_may_use_rela_p      1
/* We use REL for dynamic relocations only.  */
#undef elf_backend_default_use_rela_p
#define elf_backend_default_use_rela_p  1

#undef elf_backend_omit_section_dynsym
#define elf_backend_omit_section_dynsym _esp32s2ulpfdpic_link_omit_section_dynsym

#include "elf32-target.h"
